; ModuleID = 'm2rtttl.bc'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-p:32:32-f64:32:64-f80:32-n8:16:32-S128"
target triple = "i386-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._MIDI_FILE = type { %struct._IO_FILE*, i32, %struct.MIDI_HEADER, i8*, i32, [256 x %struct.MIDI_FILE_TRACK] }
%struct.MIDI_HEADER = type { i32, i16, i16, i16 }
%struct.MIDI_FILE_TRACK = type { i8*, i8*, i8*, i32, i32, i32, i32, i8, i8, [64 x %struct.MIDI_LAST_NOTE] }
%struct.MIDI_LAST_NOTE = type { i8, i8, i8, i8, i32 }
%struct.MIDI_END_POINT = type { i32, i32 }
%struct.MIDI_MSG = type { i32, i32, i32, i32, i32, i32, i8*, i32, %union.anon, i32, i8 }
%union.anon = type { %struct.anon.6 }
%struct.anon.6 = type { i32, %union.anon.7 }
%union.anon.7 = type { %struct.anon.10 }
%struct.anon.10 = type { i32, i32, i32, i32, i32 }
%struct.anon = type { i32, i32, i32 }
%struct.anon.8 = type { i8* }
%struct.anon.9 = type { i32 }
%struct.anon.13 = type { i8*, i32 }
%struct.CONVERT_PREFS = type { i32, i32, i32, i32, float }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"wb+\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"rb\00", align 1

!159 = !DIEnumerator(name: "ccGeneralPurpose8", value: 83)
!160 = !DIEnumerator(name: "ccPortamentoControl", value: 84)
!161 = !DIEnumerator(name: "ccUndefined85", value: 85)
!162 = !DIEnumerator(name: "ccUndefined86", value: 86)
!163 = !DIEnumerator(name: "ccUndefined87", value: 87)
!164 = !DIEnumerator(name: "ccUndefined88", value: 88)
!165 = !DIEnumerator(name: "ccUndefined89", value: 89)
!166 = !DIEnumerator(name: "ccUndefined90", value: 90)
!167 = !DIEnumerator(name: "ccFXDepth", value: 91)
!168 = !DIEnumerator(name: "ccTremeloDepth", value: 92)
!169 = !DIEnumerator(name: "ccChorusDepth", value: 93)
!170 = !DIEnumerator(name: "ccCelestaDepth", value: 94)
!171 = !DIEnumerator(name: "ccPhaserDepth", value: 95)
!172 = !DIEnumerator(name: "ccDataInc", value: 96)
!173 = !DIEnumerator(name: "ccDataDec", value: 97)
!174 = !DIEnumerator(name: "ccNonRegParamLSB", value: 98)
!175 = !DIEnumerator(name: "ccNonRefParamMSB", value: 99)
!176 = !DIEnumerator(name: "ccRegParamLSB", value: 100)
!177 = !DIEnumerator(name: "ccRegParamMSB", value: 101)
!178 = !DIEnumerator(name: "ccUndefined102", value: 102)
!179 = !DIEnumerator(name: "ccUndefined103", value: 103)
!180 = !DIEnumerator(name: "ccUndefined104", value: 104)
!181 = !DIEnumerator(name: "ccUndefined105", value: 105)
!182 = !DIEnumerator(name: "ccUndefined106", value: 106)
!183 = !DIEnumerator(name: "ccUndefined107", value: 107)
!184 = !DIEnumerator(name: "ccUndefined108", value: 108)
!185 = !DIEnumerator(name: "ccUndefined109", value: 109)
!186 = !DIEnumerator(name: "ccUndefined110", value: 110)
!187 = !DIEnumerator(name: "ccUndefined111", value: 111)
!188 = !DIEnumerator(name: "ccUndefined112", value: 112)
!189 = !DIEnumerator(name: "ccUndefined113", value: 113)
!190 = !DIEnumerator(name: "ccUndefined114", value: 114)
!191 = !DIEnumerator(name: "ccUndefined115", value: 115)
!192 = !DIEnumerator(name: "ccUndefined116", value: 116)
!193 = !DIEnumerator(name: "ccUndefined117", value: 117)
!194 = !DIEnumerator(name: "ccUndefined118", value: 118)
!195 = !DIEnumerator(name: "ccUndefined119", value: 119)
!196 = !DIEnumerator(name: "ccAllSoundOff", value: 120)
!197 = !DIEnumerator(name: "ccResetAllControllers", value: 121)
!198 = !DIEnumerator(name: "ccLocalControl", value: 122)
!199 = !DIEnumerator(name: "ccAllNotesOff", value: 123)
!200 = !DIEnumerator(name: "ccOmniModeOff", value: 124)
!201 = !DIEnumerator(name: "ccOmniModeOn", value: 125)
!202 = !DIEnumerator(name: "ccMonoModeOn", value: 126)
!203 = !DIEnumerator(name: "ccPolyModeOn", value: 127)
!204 = !DIEnumerator(name: "ccModWheel", value: 1)
!205 = !DIEnumerator(name: "ccHarmContent", value: 71)
!206 = !DIEnumerator(name: "ccSoundController1", value: 70)
!207 = !DIEnumerator(name: "ccSoundController2", value: 71)
!208 = !DIEnumerator(name: "ccSoundController3", value: 72)
!209 = !DIEnumerator(name: "ccSoundController4", value: 73)
!210 = !DIEnumerator(name: "ccSoundController5", value: 74)
!211 = !DIEnumerator(name: "ccSoundController6", value: 75)
!212 = !DIEnumerator(name: "ccSoundController7", value: 76)
!213 = !DIEnumerator(name: "ccSoundController8", value: 77)
!214 = !DIEnumerator(name: "ccSoundController9", value: 78)
!215 = !DIEnumerator(name: "ccSoundController10", value: 79)
!216 = !DIEnumerator(name: "ccEffect1Depth", value: 91)
!217 = !DIEnumerator(name: "ccEffect2Depth", value: 92)
!218 = !DIEnumerator(name: "ccEffect3Depth", value: 93)
!219 = !DIEnumerator(name: "ccEffect4Depth", value: 94)
!220 = !DIEnumerator(name: "ccEffect5Depth", value: 95)
!221 = !DIEnumerator(name: "ccDetuneDepth", value: 94)
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 298, size: 32, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!224 = !DIEnumerator(name: "metaSequenceNumber", value: 0)
!225 = !DIEnumerator(name: "metaTextEvent", value: 1)
!226 = !DIEnumerator(name: "metaCopyright", value: 2)
!227 = !DIEnumerator(name: "metaTrackName", value: 3)
!228 = !DIEnumerator(name: "metaInstrument", value: 4)
!229 = !DIEnumerator(name: "metaLyric", value: 5)
!230 = !DIEnumerator(name: "metaMarker", value: 6)
!231 = !DIEnumerator(name: "metaCuePoint", value: 7)
!232 = !DIEnumerator(name: "metaMIDIPort", value: 33)
!233 = !DIEnumerator(name: "metaEndSequence", value: 47)
!234 = !DIEnumerator(name: "metaSetTempo", value: 81)
!235 = !DIEnumerator(name: "metaSMPTEOffset", value: 84)
!236 = !DIEnumerator(name: "metaTimeSig", value: 88)
!237 = !DIEnumerator(name: "metaKeySig", value: 89)
!238 = !DIEnumerator(name: "metaSequencerSpecific", value: 127)
!239 = !{!240, !296, !323, !9, !318, !8, !322, !354, !315, !355, !356, !253, !362, !363, !364, !365}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "_MIDI_FILE", file: !3, line: 75, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 66, size: 1114336, elements: !243)
!243 = !{!244, !309, !310, !321, !325, !326}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pFile", scope: !242, file: !3, line: 67, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !247, line: 48, baseType: !248)
!247 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/songlh/workspace/github/PDebloating/stubs/midilib")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !249, line: 241, size: 1184, elements: !250)
!249 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/songlh/workspace/github/PDebloating/stubs/midilib")
!250 = !{!251, !252, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !273, !274, !275, !276, !280, !282, !284, !288, !291, !295, !297, !298, !299, !300, !304, !305}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !248, file: !249, line: 242, baseType: !8, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !248, file: !249, line: 247, baseType: !253, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !248, file: !249, line: 248, baseType: !253, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !248, file: !249, line: 249, baseType: !253, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !248, file: !249, line: 250, baseType: !253, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !248, file: !249, line: 251, baseType: !253, size: 32, offset: 160)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !248, file: !249, line: 252, baseType: !253, size: 32, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !248, file: !249, line: 253, baseType: !253, size: 32, offset: 224)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !248, file: !249, line: 254, baseType: !253, size: 32, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !248, file: !249, line: 256, baseType: !253, size: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !248, file: !249, line: 257, baseType: !253, size: 32, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !248, file: !249, line: 258, baseType: !253, size: 32, offset: 352)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !248, file: !249, line: 260, baseType: !266, size: 32, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !249, line: 156, size: 96, elements: !268)
!268 = !{!269, !270, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !267, file: !249, line: 157, baseType: !266, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !267, file: !249, line: 158, baseType: !271, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !267, file: !249, line: 162, baseType: !8, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !248, file: !249, line: 262, baseType: !271, size: 32, offset: 416)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !248, file: !249, line: 264, baseType: !8, size: 32, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !248, file: !249, line: 268, baseType: !8, size: 32, offset: 480)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !248, file: !249, line: 270, baseType: !277, size: 32, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !278, line: 131, baseType: !279)
!278 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/songlh/workspace/github/PDebloating/stubs/midilib")
!279 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !248, file: !249, line: 274, baseType: !281, size: 16, offset: 544)
!281 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !248, file: !249, line: 275, baseType: !283, size: 8, offset: 560)
!283 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !248, file: !249, line: 276, baseType: !285, size: 8, offset: 568)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 8, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 1)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !248, file: !249, line: 280, baseType: !289, size: 32, offset: 576)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !249, line: 150, baseType: null)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !248, file: !249, line: 289, baseType: !292, size: 64, offset: 608)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !278, line: 132, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !278, line: 55, baseType: !294)
!294 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !248, file: !249, line: 297, baseType: !296, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !248, file: !249, line: 298, baseType: !296, size: 32, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !248, file: !249, line: 299, baseType: !296, size: 32, offset: 736)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !248, file: !249, line: 300, baseType: !296, size: 32, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !248, file: !249, line: 302, baseType: !301, size: 32, offset: 800)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !302, line: 62, baseType: !303)
!302 = !DIFile(filename: "/home/songlh/workspace/protocol/install/lib/clang/5.0.0/include/stddef.h", directory: "/home/songlh/workspace/github/PDebloating/stubs/midilib")
!303 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !248, file: !249, line: 303, baseType: !8, size: 32, offset: 832)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !248, file: !249, line: 305, baseType: !306, size: 320, offset: 864)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 320, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 40)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bOpenForWriting", scope: !242, file: !3, line: 68, baseType: !6, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !242, file: !3, line: 70, baseType: !311, size: 96, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "MIDI_HEADER", file: !3, line: 64, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 58, size: 96, elements: !313)
!313 = !{!314, !317, !319, !320}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "iHeaderSize", scope: !312, file: !3, line: 59, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "DWORD", file: !7, line: 43, baseType: !316)
!316 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "iVersion", scope: !312, file: !3, line: 61, baseType: !318, size: 16, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD", file: !7, line: 42, baseType: !281)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "iNumTracks", scope: !312, file: !3, line: 62, baseType: !318, size: 16, offset: 48)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "PPQN", scope: !312, file: !3, line: 63, baseType: !318, size: 16, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !242, file: !3, line: 71, baseType: !322, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "BYTE", file: !7, line: 41, baseType: !324)
!324 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "file_sz", scope: !242, file: !3, line: 72, baseType: !315, size: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !242, file: !3, line: 74, baseType: !327, size: 1114112, offset: 224)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 1114112, elements: !352)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "MIDI_FILE_TRACK", file: !3, line: 56, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 41, size: 4352, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !329, file: !3, line: 42, baseType: !322, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pBase", scope: !329, file: !3, line: 43, baseType: !322, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !329, file: !3, line: 44, baseType: !322, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !329, file: !3, line: 46, baseType: !315, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !329, file: !3, line: 47, baseType: !315, size: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !329, file: !3, line: 49, baseType: !315, size: 32, offset: 160)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "iBlockSize", scope: !329, file: !3, line: 51, baseType: !315, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "iDefaultChannel", scope: !329, file: !3, line: 52, baseType: !323, size: 8, offset: 224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "last_status", scope: !329, file: !3, line: 53, baseType: !323, size: 8, offset: 232)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "LastNote", scope: !329, file: !3, line: 55, baseType: !341, size: 4096, offset: 256)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 4096, elements: !350)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "MIDI_LAST_NOTE", file: !3, line: 39, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 35, size: 64, elements: !344)
!344 = !{!345, !346, !347, !348, !349}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !343, file: !3, line: 36, baseType: !323, size: 8)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "chn", scope: !343, file: !3, line: 36, baseType: !323, size: 8, offset: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !343, file: !3, line: 37, baseType: !323, size: 8, offset: 16)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !343, file: !3, line: 37, baseType: !323, size: 8, offset: 24)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "end_pos", scope: !343, file: !3, line: 38, baseType: !315, size: 32, offset: 32)
!350 = !{!351}
!351 = !DISubrange(count: 64)
!352 = !{!353}
!353 = !DISubrange(count: 256)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "MIDI_END_POINT", file: !3, line: 431, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 428, size: 64, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "iIdx", scope: !358, file: !3, line: 429, baseType: !8, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "iEndPos", scope: !358, file: !3, line: 430, baseType: !8, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "tMIDI_MSG", file: !14, line: 49, baseType: !13)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "tMIDI_CC", file: !14, line: 212, baseType: !74)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "tMIDI_META", file: !14, line: 317, baseType: !222)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "tMIDI_KEYSIG", file: !14, line: 295, baseType: !29)
!366 = !{!0, !367, !373, !382, !390, !398, !406, !410}
!367 = !DIGlobalVariableExpression(var: !368)
!368 = distinct !DIGlobalVariable(name: "mtrk", scope: !2, file: !3, line: 588, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 32, elements: !371)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!371 = !{!372}
!372 = !DISubrange(count: 4)
!373 = !DIGlobalVariableExpression(var: !374)
!374 = distinct !DIGlobalVariable(name: "tmp", scope: !375, file: !3, line: 620, type: !379, isLocal: true, isDefinition: true)
!375 = distinct !DISubprogram(name: "midiSongAddSMPTEOffset", scope: !3, file: !3, line: 618, type: !376, isLocal: false, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!376 = !DISubroutineType(types: !377)
!377 = !{!6, !9, !8, !8, !8, !8, !8, !8}
!378 = !{}
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 8)
!382 = !DIGlobalVariableExpression(var: !383)
!383 = distinct !DIGlobalVariable(name: "tmp", scope: !384, file: !3, line: 646, type: !387, isLocal: true, isDefinition: true)
!384 = distinct !DISubprogram(name: "midiSongAddTimeSig", scope: !3, file: !3, line: 644, type: !385, isLocal: false, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!385 = !DISubroutineType(types: !386)
!386 = !{!6, !9, !8, !8, !8, !8, !8}
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 56, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 7)
!390 = !DIGlobalVariableExpression(var: !391)
!391 = distinct !DIGlobalVariable(name: "tmp", scope: !392, file: !3, line: 661, type: !395, isLocal: true, isDefinition: true)
!392 = distinct !DISubprogram(name: "midiSongAddKeySig", scope: !3, file: !3, line: 659, type: !393, isLocal: false, isDefinition: true, scopeLine: 660, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!393 = !DISubroutineType(types: !394)
!394 = !{!6, !9, !8, !365}
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 40, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 5)
!398 = !DIGlobalVariableExpression(var: !399)
!399 = distinct !DIGlobalVariable(name: "tmp", scope: !400, file: !3, line: 674, type: !403, isLocal: true, isDefinition: true)
!400 = distinct !DISubprogram(name: "midiSongAddTempo", scope: !3, file: !3, line: 672, type: !401, isLocal: false, isDefinition: true, scopeLine: 673, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!401 = !DISubroutineType(types: !402)
!402 = !{!6, !9, !8, !8}
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 48, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 6)
!406 = !DIGlobalVariableExpression(var: !407)
!407 = distinct !DIGlobalVariable(name: "tmp", scope: !408, file: !3, line: 690, type: !409, isLocal: true, isDefinition: true)
!408 = distinct !DISubprogram(name: "midiSongAddMIDIPort", scope: !3, file: !3, line: 688, type: !401, isLocal: false, isDefinition: true, scopeLine: 689, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 32, elements: !371)
!410 = !DIGlobalVariableExpression(var: !411)
!411 = distinct !DIGlobalVariable(name: "tmp", scope: !412, file: !3, line: 701, type: !415, isLocal: true, isDefinition: true)
!412 = distinct !DISubprogram(name: "midiSongAddEndSequence", scope: !3, file: !3, line: 699, type: !413, isLocal: false, isDefinition: true, scopeLine: 700, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!413 = !DISubroutineType(types: !414)
!414 = !{!6, !9, !8}
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 24, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 3)
!418 = !DIGlobalVariableExpression(var: !419)
!419 = distinct !DIGlobalVariable(name: "szPatchList", scope: !420, file: !421, line: 34, type: !450, isLocal: true, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C89, file: !421, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !438, globals: !439)
!421 = !DIFile(filename: "midiutil.c", directory: "/home/songlh/workspace/github/PDebloating/stubs/midilib")
!422 = !{!13, !74, !29, !65, !222, !423}
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 46, size: 32, elements: !425)
!424 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/songlh/workspace/github/PDebloating/stubs/midilib")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!426 = !DIEnumerator(name: "_ISupper", value: 256)
!427 = !DIEnumerator(name: "_ISlower", value: 512)
!428 = !DIEnumerator(name: "_ISalpha", value: 1024)
!429 = !DIEnumerator(name: "_ISdigit", value: 2048)
!430 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!431 = !DIEnumerator(name: "_ISspace", value: 8192)
!432 = !DIEnumerator(name: "_ISprint", value: 16384)
!433 = !DIEnumerator(name: "_ISgraph", value: 32768)
!434 = !DIEnumerator(name: "_ISblank", value: 1)
!435 = !DIEnumerator(name: "_IScntrl", value: 2)
!436 = !DIEnumerator(name: "_ISpunct", value: 4)
!437 = !DIEnumerator(name: "_ISalnum", value: 8)
!438 = !{!364, !8, !281}
!439 = !{!440, !418, !448, !453, !455, !460}
!440 = !DIGlobalVariableExpression(var: !441)
!441 = distinct !DIGlobalVariable(name: "iKeysList", scope: !442, file: !421, line: 490, type: !445, isLocal: true, isDefinition: true)
!442 = distinct !DISubprogram(name: "muGetKeySigName", scope: !421, file: !421, line: 488, type: !443, isLocal: false, isDefinition: true, scopeLine: 489, flags: DIFlagPrototyped, isOptimized: false, unit: !420, variables: !378)
!443 = !DISubroutineType(types: !444)
!444 = !{!6, !253, !365}
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 512, elements: !446)
!446 = !{!447, !381}
!447 = !DISubrange(count: 2)
!448 = !DIGlobalVariableExpression(var: !449)
!449 = distinct !DIGlobalVariable(name: "szGMDrums", scope: !420, file: !421, line: 181, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 4096, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 128)
!453 = !DIGlobalVariableExpression(var: !454)
!454 = distinct !DIGlobalVariable(name: "szCCList", scope: !420, file: !421, line: 272, type: !450, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456)
!456 = distinct !DIGlobalVariable(name: "szNoteName", scope: !420, file: !421, line: 381, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 384, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 12)
!460 = !DIGlobalVariableExpression(var: !461)
!461 = distinct !DIGlobalVariable(name: "fFreqlist", scope: !420, file: !421, line: 396, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 384, elements: !458)
!463 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!464 = !DIGlobalVariableExpression(var: !465)
!465 = distinct !DIGlobalVariable(name: "Valid", scope: !466, file: !467, line: 72, type: !488, isLocal: true, isDefinition: true)
!466 = distinct !DISubprogram(name: "rtttlGetClosestTempo", scope: !467, file: !467, line: 70, type: !468, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !470, variables: !378)
!467 = !DIFile(filename: "m2rtttl.c", directory: "/home/songlh/workspace/github/PDebloating/stubs/midilib")
!468 = !DISubroutineType(types: !469)
!469 = !{!8, !8}
!470 = distinct !DICompileUnit(language: DW_LANG_C89, file: !467, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !472, globals: !473)
!471 = !{!13, !74, !222, !29}
!472 = !{!8}
!473 = !{!464, !474}
!474 = !DIGlobalVariableExpression(var: !475)
!475 = distinct !DIGlobalVariable(name: "pNoteNames", scope: !476, file: !467, line: 111, type: !457, isLocal: true, isDefinition: true)
!476 = distinct !DISubprogram(name: "outStdout", scope: !467, file: !467, line: 109, type: !477, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false, unit: !470, variables: !378)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !8, !8, !8, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONVERT_PREFS", file: !467, line: 58, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !467, line: 51, size: 160, elements: !482)
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "iTempo", scope: !481, file: !467, line: 52, baseType: !8, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "bDoneHeader", scope: !481, file: !467, line: 54, baseType: !6, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bNeedPrefixComma", scope: !481, file: !467, line: 55, baseType: !6, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "iSndFile", scope: !481, file: !467, line: 56, baseType: !8, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fMult", scope: !481, file: !467, line: 57, baseType: !463, size: 32, offset: 128)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1024, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 32)
!491 = !{!"clang version 5.0.0 (tags/RELEASE_500/final)"}
!492 = !{i32 1, !"NumRegisterParameters", i32 0}
!493 = !{i32 2, !"Dwarf Version", i32 4}
!494 = !{i32 2, !"Debug Info Version", i32 3}
!495 = !{i32 1, !"wchar_size", i32 4}
!496 = distinct !DISubprogram(name: "midiFileCreate", scope: !3, file: !3, line: 242, type: !497, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!497 = !DISubroutineType(types: !498)
!498 = !{!9, !499, !6}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!501 = !DILocalVariable(name: "pFilename", arg: 1, scope: !496, file: !3, line: 242, type: !499)
!502 = !DIExpression()
!503 = !DILocation(line: 242, column: 40, scope: !496)
!504 = !DILocalVariable(name: "bOverwriteIfExists", arg: 2, scope: !496, file: !3, line: 242, type: !6)
!505 = !DILocation(line: 242, column: 56, scope: !496)
!506 = !DILocalVariable(name: "pMF", scope: !496, file: !3, line: 244, type: !240)
!507 = !DILocation(line: 244, column: 13, scope: !496)
!508 = !DILocation(line: 244, column: 33, scope: !496)
!509 = !DILocation(line: 244, column: 19, scope: !496)
!510 = !DILocalVariable(name: "i", scope: !496, file: !3, line: 245, type: !8)
!511 = !DILocation(line: 245, column: 5, scope: !496)
!512 = !DILocation(line: 247, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !496, file: !3, line: 247, column: 6)
!514 = !DILocation(line: 247, column: 6, scope: !496)
!515 = !DILocation(line: 247, column: 18, scope: !513)
!516 = !DILocation(line: 249, column: 7, scope: !517)
!517 = distinct !DILexicalBlock(scope: !496, file: !3, line: 249, column: 6)
!518 = !DILocation(line: 249, column: 6, scope: !496)
!519 = !DILocation(line: 251, column: 27, scope: !520)
!520 = distinct !DILexicalBlock(scope: !521, file: !3, line: 251, column: 7)
!521 = distinct !DILexicalBlock(scope: !517, file: !3, line: 250, column: 3)
!522 = !DILocation(line: 251, column: 21, scope: !520)
!523 = !DILocation(line: 251, column: 8, scope: !520)
!524 = !DILocation(line: 251, column: 13, scope: !520)
!525 = !DILocation(line: 251, column: 19, scope: !520)
!526 = !DILocation(line: 251, column: 7, scope: !521)
!527 = !DILocation(line: 253, column: 11, scope: !528)
!528 = distinct !DILexicalBlock(scope: !520, file: !3, line: 252, column: 4)
!529 = !DILocation(line: 253, column: 16, scope: !528)
!530 = !DILocation(line: 253, column: 4, scope: !528)
!531 = !DILocation(line: 254, column: 9, scope: !528)
!532 = !DILocation(line: 254, column: 4, scope: !528)
!533 = !DILocation(line: 255, column: 4, scope: !528)
!534 = !DILocation(line: 257, column: 3, scope: !521)
!535 = !DILocation(line: 259, column: 26, scope: !536)
!536 = distinct !DILexicalBlock(scope: !496, file: !3, line: 259, column: 6)
!537 = !DILocation(line: 259, column: 20, scope: !536)
!538 = !DILocation(line: 259, column: 7, scope: !536)
!539 = !DILocation(line: 259, column: 12, scope: !536)
!540 = !DILocation(line: 259, column: 18, scope: !536)
!541 = !DILocation(line: 259, column: 6, scope: !496)
!542 = !DILocation(line: 260, column: 13, scope: !543)
!543 = distinct !DILexicalBlock(scope: !536, file: !3, line: 260, column: 3)
!544 = !DILocation(line: 263, column: 16, scope: !545)
!545 = distinct !DILexicalBlock(scope: !536, file: !3, line: 262, column: 3)
!546 = !DILocation(line: 263, column: 8, scope: !545)
!547 = !DILocation(line: 263, column: 3, scope: !545)
!548 = !DILocation(line: 264, column: 3, scope: !545)
!549 = !DILocation(line: 267, column: 2, scope: !496)
!550 = !DILocation(line: 267, column: 7, scope: !496)
!551 = !DILocation(line: 267, column: 23, scope: !496)
!552 = !DILocation(line: 268, column: 2, scope: !496)
!553 = !DILocation(line: 268, column: 7, scope: !496)
!554 = !DILocation(line: 268, column: 14, scope: !496)
!555 = !DILocation(line: 268, column: 19, scope: !496)
!556 = !DILocation(line: 269, column: 2, scope: !496)
!557 = !DILocation(line: 269, column: 7, scope: !496)
!558 = !DILocation(line: 269, column: 14, scope: !496)
!559 = !DILocation(line: 269, column: 23, scope: !496)
!560 = !DILocation(line: 271, column: 7, scope: !561)
!561 = distinct !DILexicalBlock(scope: !496, file: !3, line: 271, column: 2)
!562 = !DILocation(line: 271, column: 6, scope: !561)
!563 = !DILocation(line: 271, column: 10, scope: !564)
!564 = distinct !DILexicalBlock(scope: !561, file: !3, line: 271, column: 2)
!565 = !DILocation(line: 271, column: 11, scope: !564)
!566 = !DILocation(line: 271, column: 2, scope: !561)
!567 = !DILocation(line: 273, column: 3, scope: !568)
!568 = distinct !DILexicalBlock(scope: !564, file: !3, line: 272, column: 3)
!569 = !DILocation(line: 273, column: 8, scope: !568)
!570 = !DILocation(line: 273, column: 14, scope: !568)
!571 = !DILocation(line: 273, column: 17, scope: !568)
!572 = !DILocation(line: 273, column: 21, scope: !568)
!573 = !DILocation(line: 274, column: 3, scope: !568)
!574 = !DILocation(line: 274, column: 8, scope: !568)
!575 = !DILocation(line: 274, column: 14, scope: !568)
!576 = !DILocation(line: 274, column: 17, scope: !568)
!577 = !DILocation(line: 274, column: 21, scope: !568)
!578 = !DILocation(line: 275, column: 3, scope: !568)
!579 = !DILocation(line: 275, column: 8, scope: !568)
!580 = !DILocation(line: 275, column: 14, scope: !568)
!581 = !DILocation(line: 275, column: 17, scope: !568)
!582 = !DILocation(line: 275, column: 23, scope: !568)
!583 = !DILocation(line: 276, column: 3, scope: !568)
!584 = !DILocation(line: 276, column: 8, scope: !568)
!585 = !DILocation(line: 276, column: 14, scope: !568)
!586 = !DILocation(line: 276, column: 17, scope: !568)
!587 = !DILocation(line: 276, column: 22, scope: !568)
!588 = !DILocation(line: 277, column: 3, scope: !568)
!589 = !DILocation(line: 277, column: 8, scope: !568)
!590 = !DILocation(line: 277, column: 14, scope: !568)
!591 = !DILocation(line: 277, column: 17, scope: !568)
!592 = !DILocation(line: 277, column: 28, scope: !568)
!593 = !DILocation(line: 278, column: 3, scope: !568)
!594 = !DILocation(line: 278, column: 8, scope: !568)
!595 = !DILocation(line: 278, column: 14, scope: !568)
!596 = !DILocation(line: 278, column: 17, scope: !568)
!597 = !DILocation(line: 278, column: 20, scope: !568)
!598 = !DILocation(line: 279, column: 42, scope: !568)
!599 = !DILocation(line: 279, column: 44, scope: !568)
!600 = !DILocation(line: 279, column: 35, scope: !568)
!601 = !DILocation(line: 279, column: 3, scope: !568)
!602 = !DILocation(line: 279, column: 8, scope: !568)
!603 = !DILocation(line: 279, column: 14, scope: !568)
!604 = !DILocation(line: 279, column: 17, scope: !568)
!605 = !DILocation(line: 279, column: 33, scope: !568)
!606 = !DILocation(line: 281, column: 10, scope: !568)
!607 = !DILocation(line: 281, column: 15, scope: !568)
!608 = !DILocation(line: 281, column: 21, scope: !568)
!609 = !DILocation(line: 281, column: 24, scope: !568)
!610 = !DILocation(line: 281, column: 3, scope: !568)
!611 = !DILocation(line: 282, column: 3, scope: !568)
!612 = !DILocation(line: 271, column: 28, scope: !564)
!613 = !DILocation(line: 271, column: 2, scope: !564)
!614 = distinct !{!614, !566, !615}
!615 = !DILocation(line: 282, column: 3, scope: !561)
!616 = !DILocation(line: 284, column: 22, scope: !496)
!617 = !DILocation(line: 284, column: 9, scope: !496)
!618 = !DILocation(line: 284, column: 2, scope: !496)
!619 = !DILocation(line: 285, column: 1, scope: !496)
!620 = distinct !DISubprogram(name: "midiFileSetTracksDefaultChannel", scope: !3, file: !3, line: 287, type: !621, isLocal: false, isDefinition: true, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!621 = !DISubroutineType(types: !622)
!622 = !{!8, !9, !8, !8}
!623 = !DILocalVariable(name: "_pMF", arg: 1, scope: !620, file: !3, line: 287, type: !9)
!624 = !DILocation(line: 287, column: 49, scope: !620)
!625 = !DILocalVariable(name: "iTrack", arg: 2, scope: !620, file: !3, line: 287, type: !8)
!626 = !DILocation(line: 287, column: 59, scope: !620)
!627 = !DILocalVariable(name: "iChannel", arg: 3, scope: !620, file: !3, line: 287, type: !8)
!628 = !DILocation(line: 287, column: 71, scope: !620)
!629 = !DILocalVariable(name: "prev", scope: !620, file: !3, line: 289, type: !8)
!630 = !DILocation(line: 289, column: 5, scope: !620)
!631 = !DILocalVariable(name: "pMF", scope: !620, file: !3, line: 291, type: !240)
!632 = !DILocation(line: 291, column: 2, scope: !620)
!633 = !DILocation(line: 292, column: 7, scope: !634)
!634 = distinct !DILexicalBlock(scope: !620, file: !3, line: 292, column: 6)
!635 = !DILocation(line: 292, column: 6, scope: !620)
!636 = !DILocation(line: 292, column: 31, scope: !634)
!637 = !DILocation(line: 293, column: 7, scope: !638)
!638 = distinct !DILexicalBlock(scope: !620, file: !3, line: 293, column: 6)
!639 = !DILocation(line: 293, column: 6, scope: !620)
!640 = !DILocation(line: 293, column: 32, scope: !638)
!641 = !DILocation(line: 294, column: 7, scope: !642)
!642 = distinct !DILexicalBlock(scope: !620, file: !3, line: 294, column: 6)
!643 = !DILocation(line: 294, column: 6, scope: !620)
!644 = !DILocation(line: 294, column: 35, scope: !642)
!645 = !DILocation(line: 299, column: 9, scope: !620)
!646 = !DILocation(line: 299, column: 14, scope: !620)
!647 = !DILocation(line: 299, column: 20, scope: !620)
!648 = !DILocation(line: 299, column: 28, scope: !620)
!649 = !DILocation(line: 299, column: 43, scope: !620)
!650 = !DILocation(line: 299, column: 7, scope: !620)
!651 = !DILocation(line: 300, column: 46, scope: !620)
!652 = !DILocation(line: 300, column: 54, scope: !620)
!653 = !DILocation(line: 300, column: 39, scope: !620)
!654 = !DILocation(line: 300, column: 2, scope: !620)
!655 = !DILocation(line: 300, column: 7, scope: !620)
!656 = !DILocation(line: 300, column: 13, scope: !620)
!657 = !DILocation(line: 300, column: 21, scope: !620)
!658 = !DILocation(line: 300, column: 37, scope: !620)
!659 = !DILocation(line: 301, column: 9, scope: !620)
!660 = !DILocation(line: 301, column: 2, scope: !620)
!661 = !DILocation(line: 302, column: 1, scope: !620)
!662 = distinct !DISubprogram(name: "_midiValidateTrack", scope: !3, file: !3, line: 93, type: !663, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!663 = !DISubroutineType(types: !664)
!664 = !{!6, !665, !8}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!667 = !DILocalVariable(name: "pMF", arg: 1, scope: !662, file: !3, line: 93, type: !665)
!668 = !DILocation(line: 93, column: 50, scope: !662)
!669 = !DILocalVariable(name: "iTrack", arg: 2, scope: !662, file: !3, line: 93, type: !8)
!670 = !DILocation(line: 93, column: 59, scope: !662)
!671 = !DILocation(line: 95, column: 7, scope: !672)
!672 = distinct !DILexicalBlock(scope: !662, file: !3, line: 95, column: 6)
!673 = !DILocation(line: 95, column: 6, scope: !662)
!674 = !DILocation(line: 95, column: 28, scope: !672)
!675 = !DILocation(line: 97, column: 6, scope: !676)
!676 = distinct !DILexicalBlock(scope: !662, file: !3, line: 97, column: 6)
!677 = !DILocation(line: 97, column: 11, scope: !676)
!678 = !DILocation(line: 97, column: 6, scope: !662)
!679 = !DILocation(line: 99, column: 7, scope: !680)
!680 = distinct !DILexicalBlock(scope: !681, file: !3, line: 99, column: 7)
!681 = distinct !DILexicalBlock(scope: !676, file: !3, line: 98, column: 3)
!682 = !DILocation(line: 99, column: 14, scope: !680)
!683 = !DILocation(line: 99, column: 18, scope: !680)
!684 = !DILocation(line: 99, column: 21, scope: !680)
!685 = !DILocation(line: 99, column: 28, scope: !680)
!686 = !DILocation(line: 99, column: 7, scope: !681)
!687 = !DILocation(line: 100, column: 4, scope: !680)
!688 = !DILocation(line: 101, column: 3, scope: !681)
!689 = !DILocation(line: 104, column: 8, scope: !690)
!690 = distinct !DILexicalBlock(scope: !691, file: !3, line: 104, column: 7)
!691 = distinct !DILexicalBlock(scope: !676, file: !3, line: 103, column: 3)
!692 = !DILocation(line: 104, column: 13, scope: !690)
!693 = !DILocation(line: 104, column: 7, scope: !691)
!694 = !DILocation(line: 105, column: 4, scope: !690)
!695 = !DILocation(line: 107, column: 7, scope: !696)
!696 = distinct !DILexicalBlock(scope: !691, file: !3, line: 107, column: 7)
!697 = !DILocation(line: 107, column: 14, scope: !696)
!698 = !DILocation(line: 107, column: 18, scope: !696)
!699 = !DILocation(line: 107, column: 21, scope: !696)
!700 = !DILocation(line: 107, column: 29, scope: !696)
!701 = !DILocation(line: 107, column: 34, scope: !696)
!702 = !DILocation(line: 107, column: 41, scope: !696)
!703 = !DILocation(line: 107, column: 27, scope: !696)
!704 = !DILocation(line: 107, column: 7, scope: !691)
!705 = !DILocation(line: 108, column: 4, scope: !696)
!706 = !DILocation(line: 111, column: 2, scope: !662)
!707 = !DILocation(line: 112, column: 1, scope: !662)
!708 = distinct !DISubprogram(name: "midiFileGetTracksDefaultChannel", scope: !3, file: !3, line: 304, type: !709, isLocal: false, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!709 = !DISubroutineType(types: !710)
!710 = !{!8, !711, !8}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!713 = !DILocalVariable(name: "_pMF", arg: 1, scope: !708, file: !3, line: 304, type: !711)
!714 = !DILocation(line: 304, column: 55, scope: !708)
!715 = !DILocalVariable(name: "iTrack", arg: 2, scope: !708, file: !3, line: 304, type: !8)
!716 = !DILocation(line: 304, column: 65, scope: !708)
!717 = !DILocalVariable(name: "pMF", scope: !708, file: !3, line: 306, type: !240)
!718 = !DILocation(line: 306, column: 2, scope: !708)
!719 = !DILocation(line: 307, column: 7, scope: !720)
!720 = distinct !DILexicalBlock(scope: !708, file: !3, line: 307, column: 6)
!721 = !DILocation(line: 307, column: 6, scope: !708)
!722 = !DILocation(line: 307, column: 31, scope: !720)
!723 = !DILocation(line: 308, column: 7, scope: !724)
!724 = distinct !DILexicalBlock(scope: !708, file: !3, line: 308, column: 6)
!725 = !DILocation(line: 308, column: 6, scope: !708)
!726 = !DILocation(line: 308, column: 32, scope: !724)
!727 = !DILocation(line: 310, column: 9, scope: !708)
!728 = !DILocation(line: 310, column: 14, scope: !708)
!729 = !DILocation(line: 310, column: 20, scope: !708)
!730 = !DILocation(line: 310, column: 28, scope: !708)
!731 = !DILocation(line: 310, column: 43, scope: !708)
!732 = !DILocation(line: 310, column: 2, scope: !708)
!733 = !DILocation(line: 311, column: 1, scope: !708)
!734 = distinct !DISubprogram(name: "midiFileSetPPQN", scope: !3, file: !3, line: 313, type: !735, isLocal: false, isDefinition: true, scopeLine: 314, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!735 = !DISubroutineType(types: !736)
!736 = !{!8, !9, !8}
!737 = !DILocalVariable(name: "_pMF", arg: 1, scope: !734, file: !3, line: 313, type: !9)
!738 = !DILocation(line: 313, column: 33, scope: !734)
!739 = !DILocalVariable(name: "PPQN", arg: 2, scope: !734, file: !3, line: 313, type: !8)
!740 = !DILocation(line: 313, column: 43, scope: !734)
!741 = !DILocalVariable(name: "prev", scope: !734, file: !3, line: 315, type: !8)
!742 = !DILocation(line: 315, column: 5, scope: !734)
!743 = !DILocalVariable(name: "pMF", scope: !734, file: !3, line: 317, type: !240)
!744 = !DILocation(line: 317, column: 2, scope: !734)
!745 = !DILocation(line: 318, column: 7, scope: !746)
!746 = distinct !DILexicalBlock(scope: !734, file: !3, line: 318, column: 6)
!747 = !DILocation(line: 318, column: 6, scope: !734)
!748 = !DILocation(line: 318, column: 31, scope: !746)
!749 = !DILocation(line: 319, column: 9, scope: !734)
!750 = !DILocation(line: 319, column: 14, scope: !734)
!751 = !DILocation(line: 319, column: 21, scope: !734)
!752 = !DILocation(line: 319, column: 7, scope: !734)
!753 = !DILocation(line: 320, column: 27, scope: !734)
!754 = !DILocation(line: 320, column: 21, scope: !734)
!755 = !DILocation(line: 320, column: 2, scope: !734)
!756 = !DILocation(line: 320, column: 7, scope: !734)
!757 = !DILocation(line: 320, column: 14, scope: !734)
!758 = !DILocation(line: 320, column: 19, scope: !734)
!759 = !DILocation(line: 321, column: 9, scope: !734)
!760 = !DILocation(line: 321, column: 2, scope: !734)
!761 = !DILocation(line: 322, column: 1, scope: !734)
!762 = distinct !DISubprogram(name: "midiFileGetPPQN", scope: !3, file: !3, line: 324, type: !763, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!763 = !DISubroutineType(types: !764)
!764 = !{!8, !711}
!765 = !DILocalVariable(name: "_pMF", arg: 1, scope: !762, file: !3, line: 324, type: !711)
!766 = !DILocation(line: 324, column: 39, scope: !762)
!767 = !DILocalVariable(name: "pMF", scope: !762, file: !3, line: 326, type: !240)
!768 = !DILocation(line: 326, column: 2, scope: !762)
!769 = !DILocation(line: 327, column: 7, scope: !770)
!770 = distinct !DILexicalBlock(scope: !762, file: !3, line: 327, column: 6)
!771 = !DILocation(line: 327, column: 6, scope: !762)
!772 = !DILocation(line: 327, column: 31, scope: !770)
!773 = !DILocation(line: 328, column: 14, scope: !762)
!774 = !DILocation(line: 328, column: 19, scope: !762)
!775 = !DILocation(line: 328, column: 26, scope: !762)
!776 = !DILocation(line: 328, column: 9, scope: !762)
!777 = !DILocation(line: 328, column: 2, scope: !762)
!778 = !DILocation(line: 329, column: 1, scope: !762)
!779 = distinct !DISubprogram(name: "midiFileSetVersion", scope: !3, file: !3, line: 331, type: !735, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!780 = !DILocalVariable(name: "_pMF", arg: 1, scope: !779, file: !3, line: 331, type: !9)
!781 = !DILocation(line: 331, column: 36, scope: !779)
!782 = !DILocalVariable(name: "iVersion", arg: 2, scope: !779, file: !3, line: 331, type: !8)
!783 = !DILocation(line: 331, column: 46, scope: !779)
!784 = !DILocalVariable(name: "prev", scope: !779, file: !3, line: 333, type: !8)
!785 = !DILocation(line: 333, column: 5, scope: !779)
!786 = !DILocalVariable(name: "pMF", scope: !779, file: !3, line: 335, type: !240)
!787 = !DILocation(line: 335, column: 2, scope: !779)
!788 = !DILocation(line: 336, column: 7, scope: !789)
!789 = distinct !DILexicalBlock(scope: !779, file: !3, line: 336, column: 6)
!790 = !DILocation(line: 336, column: 6, scope: !779)
!791 = !DILocation(line: 336, column: 31, scope: !789)
!792 = !DILocation(line: 337, column: 6, scope: !793)
!793 = distinct !DILexicalBlock(scope: !779, file: !3, line: 337, column: 6)
!794 = !DILocation(line: 337, column: 14, scope: !793)
!795 = !DILocation(line: 337, column: 17, scope: !793)
!796 = !DILocation(line: 337, column: 20, scope: !793)
!797 = !DILocation(line: 337, column: 28, scope: !793)
!798 = !DILocation(line: 337, column: 6, scope: !779)
!799 = !DILocation(line: 337, column: 34, scope: !793)
!800 = !DILocation(line: 338, column: 9, scope: !779)
!801 = !DILocation(line: 338, column: 14, scope: !779)
!802 = !DILocation(line: 338, column: 21, scope: !779)
!803 = !DILocation(line: 338, column: 7, scope: !779)
!804 = !DILocation(line: 339, column: 31, scope: !779)
!805 = !DILocation(line: 339, column: 25, scope: !779)
!806 = !DILocation(line: 339, column: 2, scope: !779)
!807 = !DILocation(line: 339, column: 7, scope: !779)
!808 = !DILocation(line: 339, column: 14, scope: !779)
!809 = !DILocation(line: 339, column: 23, scope: !779)
!810 = !DILocation(line: 340, column: 9, scope: !779)
!811 = !DILocation(line: 340, column: 2, scope: !779)
!812 = !DILocation(line: 341, column: 1, scope: !779)
!813 = distinct !DISubprogram(name: "midiFileGetVersion", scope: !3, file: !3, line: 343, type: !763, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!814 = !DILocalVariable(name: "_pMF", arg: 1, scope: !813, file: !3, line: 343, type: !711)
!815 = !DILocation(line: 343, column: 43, scope: !813)
!816 = !DILocalVariable(name: "pMF", scope: !813, file: !3, line: 345, type: !240)
!817 = !DILocation(line: 345, column: 2, scope: !813)
!818 = !DILocation(line: 346, column: 7, scope: !819)
!819 = distinct !DILexicalBlock(scope: !813, file: !3, line: 346, column: 6)
!820 = !DILocation(line: 346, column: 6, scope: !813)
!821 = !DILocation(line: 346, column: 31, scope: !819)
!822 = !DILocation(line: 347, column: 9, scope: !813)
!823 = !DILocation(line: 347, column: 14, scope: !813)
!824 = !DILocation(line: 347, column: 21, scope: !813)
!825 = !DILocation(line: 347, column: 2, scope: !813)
!826 = !DILocation(line: 348, column: 1, scope: !813)
!827 = distinct !DISubprogram(name: "midiFileOpen", scope: !3, file: !3, line: 350, type: !828, isLocal: false, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!828 = !DISubroutineType(types: !829)
!829 = !{!9, !499}
!830 = !DILocalVariable(name: "pFilename", arg: 1, scope: !827, file: !3, line: 350, type: !499)
!831 = !DILocation(line: 350, column: 38, scope: !827)
!832 = !DILocalVariable(name: "fp", scope: !827, file: !3, line: 352, type: !245)
!833 = !DILocation(line: 352, column: 7, scope: !827)
!834 = !DILocation(line: 352, column: 18, scope: !827)
!835 = !DILocation(line: 352, column: 12, scope: !827)
!836 = !DILocalVariable(name: "pMF", scope: !827, file: !3, line: 353, type: !240)
!837 = !DILocation(line: 353, column: 13, scope: !827)
!838 = !DILocalVariable(name: "ptr", scope: !827, file: !3, line: 354, type: !322)
!839 = !DILocation(line: 354, column: 7, scope: !827)
!840 = !DILocalVariable(name: "bValidFile", scope: !827, file: !3, line: 355, type: !6)
!841 = !DILocation(line: 355, column: 6, scope: !827)
!842 = !DILocalVariable(name: "size", scope: !827, file: !3, line: 356, type: !279)
!843 = !DILocation(line: 356, column: 6, scope: !827)
!844 = !DILocation(line: 358, column: 6, scope: !845)
!845 = distinct !DILexicalBlock(scope: !827, file: !3, line: 358, column: 6)
!846 = !DILocation(line: 358, column: 6, scope: !827)
!847 = !DILocation(line: 360, column: 28, scope: !848)
!848 = distinct !DILexicalBlock(scope: !849, file: !3, line: 360, column: 7)
!849 = distinct !DILexicalBlock(scope: !845, file: !3, line: 359, column: 3)
!850 = !DILocation(line: 360, column: 14, scope: !848)
!851 = !DILocation(line: 360, column: 12, scope: !848)
!852 = !DILocation(line: 360, column: 7, scope: !849)
!853 = !DILocation(line: 362, column: 10, scope: !854)
!854 = distinct !DILexicalBlock(scope: !848, file: !3, line: 361, column: 4)
!855 = !DILocation(line: 362, column: 4, scope: !854)
!856 = !DILocation(line: 363, column: 17, scope: !854)
!857 = !DILocation(line: 363, column: 11, scope: !854)
!858 = !DILocation(line: 363, column: 9, scope: !854)
!859 = !DILocation(line: 364, column: 35, scope: !860)
!860 = distinct !DILexicalBlock(scope: !854, file: !3, line: 364, column: 8)
!861 = !DILocation(line: 364, column: 28, scope: !860)
!862 = !DILocation(line: 364, column: 9, scope: !860)
!863 = !DILocation(line: 364, column: 14, scope: !860)
!864 = !DILocation(line: 364, column: 18, scope: !860)
!865 = !DILocation(line: 364, column: 8, scope: !854)
!866 = !DILocation(line: 366, column: 11, scope: !867)
!867 = distinct !DILexicalBlock(scope: !860, file: !3, line: 365, column: 5)
!868 = !DILocation(line: 366, column: 5, scope: !867)
!869 = !DILocation(line: 367, column: 11, scope: !867)
!870 = !DILocation(line: 367, column: 16, scope: !867)
!871 = !DILocation(line: 367, column: 35, scope: !867)
!872 = !DILocation(line: 367, column: 41, scope: !867)
!873 = !DILocation(line: 367, column: 5, scope: !867)
!874 = !DILocation(line: 369, column: 11, scope: !867)
!875 = !DILocation(line: 369, column: 16, scope: !867)
!876 = !DILocation(line: 369, column: 9, scope: !867)
!877 = !DILocation(line: 370, column: 11, scope: !878)
!878 = distinct !DILexicalBlock(scope: !867, file: !3, line: 370, column: 9)
!879 = !DILocation(line: 370, column: 14, scope: !878)
!880 = !DILocation(line: 370, column: 9, scope: !878)
!881 = !DILocation(line: 370, column: 18, scope: !878)
!882 = !DILocation(line: 370, column: 25, scope: !878)
!883 = !DILocation(line: 370, column: 30, scope: !878)
!884 = !DILocation(line: 370, column: 33, scope: !878)
!885 = !DILocation(line: 370, column: 28, scope: !878)
!886 = !DILocation(line: 370, column: 37, scope: !878)
!887 = !DILocation(line: 370, column: 44, scope: !878)
!888 = !DILocation(line: 371, column: 8, scope: !878)
!889 = !DILocation(line: 371, column: 11, scope: !878)
!890 = !DILocation(line: 371, column: 6, scope: !878)
!891 = !DILocation(line: 371, column: 15, scope: !878)
!892 = !DILocation(line: 371, column: 22, scope: !878)
!893 = !DILocation(line: 371, column: 27, scope: !878)
!894 = !DILocation(line: 371, column: 30, scope: !878)
!895 = !DILocation(line: 371, column: 25, scope: !878)
!896 = !DILocation(line: 371, column: 34, scope: !878)
!897 = !DILocation(line: 370, column: 9, scope: !867)
!898 = !DILocalVariable(name: "dwData", scope: !899, file: !3, line: 373, type: !315)
!899 = distinct !DILexicalBlock(scope: !878, file: !3, line: 372, column: 6)
!900 = !DILocation(line: 373, column: 12, scope: !899)
!901 = !DILocalVariable(name: "wData", scope: !899, file: !3, line: 374, type: !318)
!902 = !DILocation(line: 374, column: 11, scope: !899)
!903 = !DILocalVariable(name: "i", scope: !899, file: !3, line: 375, type: !8)
!904 = !DILocation(line: 375, column: 10, scope: !899)
!905 = !DILocation(line: 377, column: 27, scope: !899)
!906 = !DILocation(line: 377, column: 30, scope: !899)
!907 = !DILocation(line: 377, column: 15, scope: !899)
!908 = !DILocation(line: 377, column: 13, scope: !899)
!909 = !DILocation(line: 378, column: 32, scope: !899)
!910 = !DILocation(line: 378, column: 6, scope: !899)
!911 = !DILocation(line: 378, column: 11, scope: !899)
!912 = !DILocation(line: 378, column: 18, scope: !899)
!913 = !DILocation(line: 378, column: 30, scope: !899)
!914 = !DILocation(line: 380, column: 25, scope: !899)
!915 = !DILocation(line: 380, column: 28, scope: !899)
!916 = !DILocation(line: 380, column: 14, scope: !899)
!917 = !DILocation(line: 380, column: 12, scope: !899)
!918 = !DILocation(line: 381, column: 35, scope: !899)
!919 = !DILocation(line: 381, column: 6, scope: !899)
!920 = !DILocation(line: 381, column: 11, scope: !899)
!921 = !DILocation(line: 381, column: 18, scope: !899)
!922 = !DILocation(line: 381, column: 27, scope: !899)
!923 = !DILocation(line: 383, column: 25, scope: !899)
!924 = !DILocation(line: 383, column: 28, scope: !899)
!925 = !DILocation(line: 383, column: 14, scope: !899)
!926 = !DILocation(line: 383, column: 12, scope: !899)
!927 = !DILocation(line: 384, column: 37, scope: !899)
!928 = !DILocation(line: 384, column: 6, scope: !899)
!929 = !DILocation(line: 384, column: 11, scope: !899)
!930 = !DILocation(line: 384, column: 18, scope: !899)
!931 = !DILocation(line: 384, column: 29, scope: !899)
!932 = !DILocation(line: 386, column: 25, scope: !899)
!933 = !DILocation(line: 386, column: 28, scope: !899)
!934 = !DILocation(line: 386, column: 14, scope: !899)
!935 = !DILocation(line: 386, column: 12, scope: !899)
!936 = !DILocation(line: 387, column: 31, scope: !899)
!937 = !DILocation(line: 387, column: 6, scope: !899)
!938 = !DILocation(line: 387, column: 11, scope: !899)
!939 = !DILocation(line: 387, column: 18, scope: !899)
!940 = !DILocation(line: 387, column: 23, scope: !899)
!941 = !DILocation(line: 389, column: 13, scope: !899)
!942 = !DILocation(line: 389, column: 18, scope: !899)
!943 = !DILocation(line: 389, column: 25, scope: !899)
!944 = !DILocation(line: 389, column: 36, scope: !899)
!945 = !DILocation(line: 389, column: 10, scope: !899)
!946 = !DILocation(line: 393, column: 11, scope: !947)
!947 = distinct !DILexicalBlock(scope: !899, file: !3, line: 393, column: 6)
!948 = !DILocation(line: 393, column: 10, scope: !947)
!949 = !DILocation(line: 393, column: 14, scope: !950)
!950 = distinct !DILexicalBlock(scope: !947, file: !3, line: 393, column: 6)
!951 = !DILocation(line: 393, column: 15, scope: !950)
!952 = !DILocation(line: 393, column: 6, scope: !947)
!953 = !DILocation(line: 395, column: 7, scope: !954)
!954 = distinct !DILexicalBlock(scope: !950, file: !3, line: 394, column: 7)
!955 = !DILocation(line: 395, column: 12, scope: !954)
!956 = !DILocation(line: 395, column: 18, scope: !954)
!957 = !DILocation(line: 395, column: 21, scope: !954)
!958 = !DILocation(line: 395, column: 25, scope: !954)
!959 = !DILocation(line: 396, column: 7, scope: !954)
!960 = !DILocation(line: 396, column: 12, scope: !954)
!961 = !DILocation(line: 396, column: 18, scope: !954)
!962 = !DILocation(line: 396, column: 21, scope: !954)
!963 = !DILocation(line: 396, column: 33, scope: !954)
!964 = !DILocation(line: 397, column: 7, scope: !954)
!965 = !DILocation(line: 393, column: 32, scope: !950)
!966 = !DILocation(line: 393, column: 6, scope: !950)
!967 = distinct !{!967, !952, !968}
!968 = !DILocation(line: 397, column: 7, scope: !947)
!969 = !DILocation(line: 399, column: 11, scope: !970)
!970 = distinct !DILexicalBlock(scope: !899, file: !3, line: 399, column: 6)
!971 = !DILocation(line: 399, column: 10, scope: !970)
!972 = !DILocation(line: 399, column: 14, scope: !973)
!973 = distinct !DILexicalBlock(scope: !970, file: !3, line: 399, column: 6)
!974 = !DILocation(line: 399, column: 16, scope: !973)
!975 = !DILocation(line: 399, column: 21, scope: !973)
!976 = !DILocation(line: 399, column: 28, scope: !973)
!977 = !DILocation(line: 399, column: 15, scope: !973)
!978 = !DILocation(line: 399, column: 6, scope: !970)
!979 = !DILocation(line: 401, column: 29, scope: !980)
!980 = distinct !DILexicalBlock(scope: !973, file: !3, line: 400, column: 7)
!981 = !DILocation(line: 401, column: 7, scope: !980)
!982 = !DILocation(line: 401, column: 12, scope: !980)
!983 = !DILocation(line: 401, column: 18, scope: !980)
!984 = !DILocation(line: 401, column: 21, scope: !980)
!985 = !DILocation(line: 401, column: 27, scope: !980)
!986 = !DILocation(line: 402, column: 27, scope: !980)
!987 = !DILocation(line: 402, column: 30, scope: !980)
!988 = !DILocation(line: 402, column: 7, scope: !980)
!989 = !DILocation(line: 402, column: 12, scope: !980)
!990 = !DILocation(line: 402, column: 18, scope: !980)
!991 = !DILocation(line: 402, column: 21, scope: !980)
!992 = !DILocation(line: 402, column: 25, scope: !980)
!993 = !DILocation(line: 403, column: 28, scope: !980)
!994 = !DILocation(line: 403, column: 31, scope: !980)
!995 = !DILocation(line: 403, column: 16, scope: !980)
!996 = !DILocation(line: 403, column: 14, scope: !980)
!997 = !DILocation(line: 404, column: 26, scope: !980)
!998 = !DILocation(line: 404, column: 7, scope: !980)
!999 = !DILocation(line: 404, column: 12, scope: !980)
!1000 = !DILocation(line: 404, column: 18, scope: !980)
!1001 = !DILocation(line: 404, column: 21, scope: !980)
!1002 = !DILocation(line: 404, column: 24, scope: !980)
!1003 = !DILocation(line: 405, column: 28, scope: !980)
!1004 = !DILocation(line: 405, column: 32, scope: !980)
!1005 = !DILocation(line: 405, column: 37, scope: !980)
!1006 = !DILocation(line: 405, column: 43, scope: !980)
!1007 = !DILocation(line: 405, column: 46, scope: !980)
!1008 = !DILocation(line: 405, column: 31, scope: !980)
!1009 = !DILocation(line: 405, column: 48, scope: !980)
!1010 = !DILocation(line: 405, column: 7, scope: !980)
!1011 = !DILocation(line: 405, column: 12, scope: !980)
!1012 = !DILocation(line: 405, column: 18, scope: !980)
!1013 = !DILocation(line: 405, column: 21, scope: !980)
!1014 = !DILocation(line: 405, column: 26, scope: !980)
!1015 = !DILocation(line: 406, column: 14, scope: !980)
!1016 = !DILocation(line: 406, column: 19, scope: !980)
!1017 = !DILocation(line: 406, column: 25, scope: !980)
!1018 = !DILocation(line: 406, column: 28, scope: !980)
!1019 = !DILocation(line: 406, column: 30, scope: !980)
!1020 = !DILocation(line: 406, column: 11, scope: !980)
!1021 = !DILocation(line: 407, column: 7, scope: !980)
!1022 = !DILocation(line: 399, column: 39, scope: !973)
!1023 = !DILocation(line: 399, column: 6, scope: !973)
!1024 = distinct !{!1024, !978, !1025}
!1025 = !DILocation(line: 407, column: 7, scope: !970)
!1026 = !DILocation(line: 409, column: 6, scope: !899)
!1027 = !DILocation(line: 409, column: 11, scope: !899)
!1028 = !DILocation(line: 409, column: 27, scope: !899)
!1029 = !DILocation(line: 410, column: 6, scope: !899)
!1030 = !DILocation(line: 410, column: 11, scope: !899)
!1031 = !DILocation(line: 410, column: 17, scope: !899)
!1032 = !DILocation(line: 411, column: 17, scope: !899)
!1033 = !DILocation(line: 412, column: 6, scope: !899)
!1034 = !DILocation(line: 413, column: 5, scope: !867)
!1035 = !DILocation(line: 414, column: 4, scope: !854)
!1036 = !DILocation(line: 416, column: 10, scope: !849)
!1037 = !DILocation(line: 416, column: 3, scope: !849)
!1038 = !DILocation(line: 417, column: 3, scope: !849)
!1039 = !DILocation(line: 419, column: 7, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !827, file: !3, line: 419, column: 6)
!1041 = !DILocation(line: 419, column: 6, scope: !827)
!1042 = !DILocation(line: 421, column: 7, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 421, column: 7)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 420, column: 3)
!1045 = !DILocation(line: 421, column: 7, scope: !1044)
!1046 = !DILocation(line: 421, column: 26, scope: !1043)
!1047 = !DILocation(line: 421, column: 18, scope: !1043)
!1048 = !DILocation(line: 421, column: 13, scope: !1043)
!1049 = !DILocation(line: 422, column: 3, scope: !1044)
!1050 = !DILocation(line: 425, column: 22, scope: !827)
!1051 = !DILocation(line: 425, column: 9, scope: !827)
!1052 = !DILocation(line: 425, column: 2, scope: !827)
!1053 = !DILocation(line: 426, column: 1, scope: !827)
!1054 = distinct !DISubprogram(name: "midiFileFlushTrack", scope: !3, file: !3, line: 441, type: !1055, isLocal: false, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!6, !9, !8, !6, !315}
!1057 = !DILocalVariable(name: "_pMF", arg: 1, scope: !1054, file: !3, line: 441, type: !9)
!1058 = !DILocation(line: 441, column: 36, scope: !1054)
!1059 = !DILocalVariable(name: "iTrack", arg: 2, scope: !1054, file: !3, line: 441, type: !8)
!1060 = !DILocation(line: 441, column: 46, scope: !1054)
!1061 = !DILocalVariable(name: "bFlushToEnd", arg: 3, scope: !1054, file: !3, line: 441, type: !6)
!1062 = !DILocation(line: 441, column: 59, scope: !1054)
!1063 = !DILocalVariable(name: "dwEndTimePos", arg: 4, scope: !1054, file: !3, line: 441, type: !315)
!1064 = !DILocation(line: 441, column: 78, scope: !1054)
!1065 = !DILocalVariable(name: "sz", scope: !1054, file: !3, line: 443, type: !8)
!1066 = !DILocation(line: 443, column: 5, scope: !1054)
!1067 = !DILocalVariable(name: "ptr", scope: !1054, file: !3, line: 444, type: !322)
!1068 = !DILocation(line: 444, column: 7, scope: !1054)
!1069 = !DILocalVariable(name: "pEndPoints", scope: !1054, file: !3, line: 445, type: !356)
!1070 = !DILocation(line: 445, column: 17, scope: !1054)
!1071 = !DILocalVariable(name: "num", scope: !1054, file: !3, line: 446, type: !8)
!1072 = !DILocation(line: 446, column: 5, scope: !1054)
!1073 = !DILocalVariable(name: "i", scope: !1054, file: !3, line: 446, type: !8)
!1074 = !DILocation(line: 446, column: 10, scope: !1054)
!1075 = !DILocalVariable(name: "mx_pts", scope: !1054, file: !3, line: 446, type: !8)
!1076 = !DILocation(line: 446, column: 13, scope: !1054)
!1077 = !DILocalVariable(name: "bNoChanges", scope: !1054, file: !3, line: 447, type: !6)
!1078 = !DILocation(line: 447, column: 6, scope: !1054)
!1079 = !DILocalVariable(name: "pMF", scope: !1054, file: !3, line: 449, type: !240)
!1080 = !DILocation(line: 449, column: 2, scope: !1054)
!1081 = !DILocation(line: 450, column: 7, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 450, column: 6)
!1083 = !DILocation(line: 450, column: 6, scope: !1054)
!1084 = !DILocation(line: 450, column: 31, scope: !1082)
!1085 = !DILocation(line: 451, column: 26, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 451, column: 6)
!1087 = !DILocation(line: 451, column: 31, scope: !1086)
!1088 = !DILocation(line: 451, column: 7, scope: !1086)
!1089 = !DILocation(line: 451, column: 6, scope: !1054)
!1090 = !DILocation(line: 451, column: 40, scope: !1086)
!1091 = !DILocation(line: 452, column: 5, scope: !1054)
!1092 = !DILocation(line: 457, column: 40, scope: !1054)
!1093 = !DILocation(line: 457, column: 43, scope: !1054)
!1094 = !DILocation(line: 457, column: 33, scope: !1054)
!1095 = !DILocation(line: 457, column: 15, scope: !1054)
!1096 = !DILocation(line: 457, column: 13, scope: !1054)
!1097 = !DILocation(line: 458, column: 9, scope: !1054)
!1098 = !DILocation(line: 459, column: 7, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 459, column: 2)
!1100 = !DILocation(line: 459, column: 6, scope: !1099)
!1101 = !DILocation(line: 459, column: 10, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 459, column: 2)
!1103 = !DILocation(line: 459, column: 12, scope: !1102)
!1104 = !DILocation(line: 459, column: 11, scope: !1102)
!1105 = !DILocation(line: 459, column: 2, scope: !1099)
!1106 = !DILocation(line: 460, column: 7, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 460, column: 7)
!1108 = !DILocation(line: 460, column: 12, scope: !1107)
!1109 = !DILocation(line: 460, column: 18, scope: !1107)
!1110 = !DILocation(line: 460, column: 26, scope: !1107)
!1111 = !DILocation(line: 460, column: 35, scope: !1107)
!1112 = !DILocation(line: 460, column: 38, scope: !1107)
!1113 = !DILocation(line: 460, column: 7, scope: !1102)
!1114 = !DILocation(line: 462, column: 30, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 461, column: 4)
!1116 = !DILocation(line: 462, column: 4, scope: !1115)
!1117 = !DILocation(line: 462, column: 15, scope: !1115)
!1118 = !DILocation(line: 462, column: 23, scope: !1115)
!1119 = !DILocation(line: 462, column: 28, scope: !1115)
!1120 = !DILocation(line: 463, column: 33, scope: !1115)
!1121 = !DILocation(line: 463, column: 38, scope: !1115)
!1122 = !DILocation(line: 463, column: 44, scope: !1115)
!1123 = !DILocation(line: 463, column: 52, scope: !1115)
!1124 = !DILocation(line: 463, column: 61, scope: !1115)
!1125 = !DILocation(line: 463, column: 64, scope: !1115)
!1126 = !DILocation(line: 463, column: 4, scope: !1115)
!1127 = !DILocation(line: 463, column: 15, scope: !1115)
!1128 = !DILocation(line: 463, column: 23, scope: !1115)
!1129 = !DILocation(line: 463, column: 31, scope: !1115)
!1130 = !DILocation(line: 464, column: 10, scope: !1115)
!1131 = !DILocation(line: 465, column: 4, scope: !1115)
!1132 = !DILocation(line: 459, column: 15, scope: !1102)
!1133 = !DILocation(line: 459, column: 2, scope: !1102)
!1134 = distinct !{!1134, !1105, !1135}
!1135 = !DILocation(line: 465, column: 4, scope: !1099)
!1136 = !DILocation(line: 467, column: 6, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 467, column: 6)
!1138 = !DILocation(line: 467, column: 6, scope: !1054)
!1139 = !DILocation(line: 469, column: 7, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 469, column: 7)
!1141 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 468, column: 3)
!1142 = !DILocation(line: 469, column: 7, scope: !1141)
!1143 = !DILocation(line: 470, column: 19, scope: !1140)
!1144 = !DILocation(line: 470, column: 30, scope: !1140)
!1145 = !DILocation(line: 470, column: 36, scope: !1140)
!1146 = !DILocation(line: 470, column: 40, scope: !1140)
!1147 = !DILocation(line: 470, column: 17, scope: !1140)
!1148 = !DILocation(line: 470, column: 4, scope: !1140)
!1149 = !DILocation(line: 472, column: 19, scope: !1140)
!1150 = !DILocation(line: 472, column: 24, scope: !1140)
!1151 = !DILocation(line: 472, column: 30, scope: !1140)
!1152 = !DILocation(line: 472, column: 38, scope: !1140)
!1153 = !DILocation(line: 472, column: 17, scope: !1140)
!1154 = !DILocation(line: 473, column: 3, scope: !1141)
!1155 = !DILocation(line: 475, column: 6, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 475, column: 6)
!1157 = !DILocation(line: 475, column: 6, scope: !1054)
!1158 = !DILocation(line: 478, column: 9, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 476, column: 3)
!1160 = !DILocation(line: 478, column: 21, scope: !1159)
!1161 = !DILocation(line: 478, column: 3, scope: !1159)
!1162 = !DILocation(line: 480, column: 5, scope: !1159)
!1163 = !DILocation(line: 481, column: 3, scope: !1159)
!1164 = !DILocation(line: 481, column: 11, scope: !1159)
!1165 = !DILocation(line: 481, column: 34, scope: !1159)
!1166 = !DILocation(line: 481, column: 45, scope: !1159)
!1167 = !DILocation(line: 481, column: 48, scope: !1159)
!1168 = !DILocation(line: 481, column: 24, scope: !1159)
!1169 = !DILocation(line: 481, column: 56, scope: !1159)
!1170 = !DILocation(line: 481, column: 59, scope: !1159)
!1171 = !DILocation(line: 481, column: 72, scope: !1159)
!1172 = !DILocation(line: 481, column: 75, scope: !1159)
!1173 = !DILocation(line: 481, column: 77, scope: !1159)
!1174 = !DILocation(line: 481, column: 76, scope: !1159)
!1175 = !DILocation(line: 483, column: 22, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1159, file: !3, line: 482, column: 4)
!1177 = !DILocation(line: 483, column: 27, scope: !1176)
!1178 = !DILocation(line: 483, column: 10, scope: !1176)
!1179 = !DILocation(line: 483, column: 8, scope: !1176)
!1180 = !DILocation(line: 484, column: 9, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 484, column: 8)
!1182 = !DILocation(line: 484, column: 8, scope: !1176)
!1183 = !DILocation(line: 485, column: 5, scope: !1181)
!1184 = !DILocation(line: 487, column: 10, scope: !1176)
!1185 = !DILocation(line: 487, column: 21, scope: !1176)
!1186 = !DILocation(line: 487, column: 24, scope: !1176)
!1187 = !DILocation(line: 487, column: 8, scope: !1176)
!1188 = !DILocation(line: 489, column: 27, scope: !1176)
!1189 = !DILocation(line: 489, column: 32, scope: !1176)
!1190 = !DILocation(line: 489, column: 37, scope: !1176)
!1191 = !DILocation(line: 489, column: 43, scope: !1176)
!1192 = !DILocation(line: 489, column: 51, scope: !1176)
!1193 = !DILocation(line: 489, column: 60, scope: !1176)
!1194 = !DILocation(line: 489, column: 65, scope: !1176)
!1195 = !DILocation(line: 489, column: 75, scope: !1176)
!1196 = !DILocation(line: 489, column: 80, scope: !1176)
!1197 = !DILocation(line: 489, column: 86, scope: !1176)
!1198 = !DILocation(line: 489, column: 94, scope: !1176)
!1199 = !DILocation(line: 489, column: 73, scope: !1176)
!1200 = !DILocation(line: 489, column: 10, scope: !1176)
!1201 = !DILocation(line: 489, column: 8, scope: !1176)
!1202 = !DILocation(line: 491, column: 33, scope: !1176)
!1203 = !DILocation(line: 491, column: 38, scope: !1176)
!1204 = !DILocation(line: 491, column: 44, scope: !1176)
!1205 = !DILocation(line: 491, column: 52, scope: !1176)
!1206 = !DILocation(line: 491, column: 61, scope: !1176)
!1207 = !DILocation(line: 491, column: 66, scope: !1176)
!1208 = !DILocation(line: 491, column: 31, scope: !1176)
!1209 = !DILocation(line: 491, column: 13, scope: !1176)
!1210 = !DILocation(line: 491, column: 8, scope: !1176)
!1211 = !DILocation(line: 491, column: 11, scope: !1176)
!1212 = !DILocation(line: 492, column: 13, scope: !1176)
!1213 = !DILocation(line: 492, column: 18, scope: !1176)
!1214 = !DILocation(line: 492, column: 24, scope: !1176)
!1215 = !DILocation(line: 492, column: 32, scope: !1176)
!1216 = !DILocation(line: 492, column: 41, scope: !1176)
!1217 = !DILocation(line: 492, column: 46, scope: !1176)
!1218 = !DILocation(line: 492, column: 8, scope: !1176)
!1219 = !DILocation(line: 492, column: 11, scope: !1176)
!1220 = !DILocation(line: 493, column: 8, scope: !1176)
!1221 = !DILocation(line: 493, column: 11, scope: !1176)
!1222 = !DILocation(line: 495, column: 4, scope: !1176)
!1223 = !DILocation(line: 495, column: 9, scope: !1176)
!1224 = !DILocation(line: 495, column: 15, scope: !1176)
!1225 = !DILocation(line: 495, column: 23, scope: !1176)
!1226 = !DILocation(line: 495, column: 32, scope: !1176)
!1227 = !DILocation(line: 495, column: 37, scope: !1176)
!1228 = !DILocation(line: 495, column: 43, scope: !1176)
!1229 = !DILocation(line: 496, column: 29, scope: !1176)
!1230 = !DILocation(line: 496, column: 34, scope: !1176)
!1231 = !DILocation(line: 496, column: 40, scope: !1176)
!1232 = !DILocation(line: 496, column: 48, scope: !1176)
!1233 = !DILocation(line: 496, column: 57, scope: !1176)
!1234 = !DILocation(line: 496, column: 62, scope: !1176)
!1235 = !DILocation(line: 496, column: 4, scope: !1176)
!1236 = !DILocation(line: 496, column: 9, scope: !1176)
!1237 = !DILocation(line: 496, column: 15, scope: !1176)
!1238 = !DILocation(line: 496, column: 23, scope: !1176)
!1239 = !DILocation(line: 496, column: 27, scope: !1176)
!1240 = !DILocation(line: 498, column: 29, scope: !1176)
!1241 = !DILocation(line: 498, column: 4, scope: !1176)
!1242 = !DILocation(line: 498, column: 9, scope: !1176)
!1243 = !DILocation(line: 498, column: 15, scope: !1176)
!1244 = !DILocation(line: 498, column: 23, scope: !1176)
!1245 = !DILocation(line: 498, column: 27, scope: !1176)
!1246 = !DILocation(line: 500, column: 4, scope: !1176)
!1247 = !DILocation(line: 501, column: 15, scope: !1176)
!1248 = distinct !{!1248, !1163, !1249}
!1249 = !DILocation(line: 502, column: 4, scope: !1159)
!1250 = !DILocation(line: 503, column: 3, scope: !1159)
!1251 = !DILocation(line: 505, column: 15, scope: !1054)
!1252 = !DILocation(line: 505, column: 7, scope: !1054)
!1253 = !DILocation(line: 505, column: 2, scope: !1054)
!1254 = !DILocation(line: 509, column: 26, scope: !1054)
!1255 = !DILocation(line: 509, column: 41, scope: !1054)
!1256 = !DILocation(line: 509, column: 46, scope: !1054)
!1257 = !DILocation(line: 509, column: 52, scope: !1054)
!1258 = !DILocation(line: 509, column: 60, scope: !1054)
!1259 = !DILocation(line: 509, column: 39, scope: !1054)
!1260 = !DILocation(line: 509, column: 2, scope: !1054)
!1261 = !DILocation(line: 509, column: 7, scope: !1054)
!1262 = !DILocation(line: 509, column: 13, scope: !1054)
!1263 = !DILocation(line: 509, column: 21, scope: !1054)
!1264 = !DILocation(line: 509, column: 24, scope: !1054)
!1265 = !DILocation(line: 511, column: 2, scope: !1054)
!1266 = !DILocation(line: 512, column: 1, scope: !1054)
!1267 = distinct !DISubprogram(name: "qs_cmp_pEndPoints", scope: !3, file: !3, line: 433, type: !1268, isLocal: true, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!8, !1270, !1270}
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 32)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1272 = !DILocalVariable(name: "e1", arg: 1, scope: !1267, file: !3, line: 433, type: !1270)
!1273 = !DILocation(line: 433, column: 42, scope: !1267)
!1274 = !DILocalVariable(name: "e2", arg: 2, scope: !1267, file: !3, line: 433, type: !1270)
!1275 = !DILocation(line: 433, column: 58, scope: !1267)
!1276 = !DILocalVariable(name: "p1", scope: !1267, file: !3, line: 435, type: !356)
!1277 = !DILocation(line: 435, column: 17, scope: !1267)
!1278 = !DILocation(line: 435, column: 40, scope: !1267)
!1279 = !DILocation(line: 435, column: 22, scope: !1267)
!1280 = !DILocalVariable(name: "p2", scope: !1267, file: !3, line: 436, type: !356)
!1281 = !DILocation(line: 436, column: 17, scope: !1267)
!1282 = !DILocation(line: 436, column: 40, scope: !1267)
!1283 = !DILocation(line: 436, column: 22, scope: !1267)
!1284 = !DILocation(line: 438, column: 9, scope: !1267)
!1285 = !DILocation(line: 438, column: 13, scope: !1267)
!1286 = !DILocation(line: 438, column: 21, scope: !1267)
!1287 = !DILocation(line: 438, column: 25, scope: !1267)
!1288 = !DILocation(line: 438, column: 20, scope: !1267)
!1289 = !DILocation(line: 438, column: 2, scope: !1267)
!1290 = distinct !DISubprogram(name: "_midiGetPtr", scope: !3, file: !3, line: 142, type: !1291, isLocal: true, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!322, !240, !8, !8}
!1293 = !DILocalVariable(name: "pMF", arg: 1, scope: !1290, file: !3, line: 142, type: !240)
!1294 = !DILocation(line: 142, column: 38, scope: !1290)
!1295 = !DILocalVariable(name: "iTrack", arg: 2, scope: !1290, file: !3, line: 142, type: !8)
!1296 = !DILocation(line: 142, column: 47, scope: !1290)
!1297 = !DILocalVariable(name: "sz_reqd", arg: 3, scope: !1290, file: !3, line: 142, type: !8)
!1298 = !DILocation(line: 142, column: 59, scope: !1290)
!1299 = !DILocalVariable(name: "mem_sz_inc", scope: !1290, file: !3, line: 144, type: !1300)
!1300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!1301 = !DILocation(line: 144, column: 13, scope: !1290)
!1302 = !DILocalVariable(name: "ptr", scope: !1290, file: !3, line: 145, type: !322)
!1303 = !DILocation(line: 145, column: 7, scope: !1290)
!1304 = !DILocalVariable(name: "curr_offset", scope: !1290, file: !3, line: 146, type: !8)
!1305 = !DILocation(line: 146, column: 5, scope: !1290)
!1306 = !DILocalVariable(name: "pTrack", scope: !1290, file: !3, line: 147, type: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!1308 = !DILocation(line: 147, column: 18, scope: !1290)
!1309 = !DILocation(line: 147, column: 28, scope: !1290)
!1310 = !DILocation(line: 147, column: 33, scope: !1290)
!1311 = !DILocation(line: 147, column: 39, scope: !1290)
!1312 = !DILocation(line: 149, column: 8, scope: !1290)
!1313 = !DILocation(line: 149, column: 16, scope: !1290)
!1314 = !DILocation(line: 149, column: 6, scope: !1290)
!1315 = !DILocation(line: 150, column: 6, scope: !1316)
!1316 = distinct !DILexicalBlock(scope: !1290, file: !3, line: 150, column: 6)
!1317 = !DILocation(line: 150, column: 10, scope: !1316)
!1318 = !DILocation(line: 150, column: 18, scope: !1316)
!1319 = !DILocation(line: 150, column: 21, scope: !1316)
!1320 = !DILocation(line: 150, column: 25, scope: !1316)
!1321 = !DILocation(line: 150, column: 24, scope: !1316)
!1322 = !DILocation(line: 150, column: 35, scope: !1316)
!1323 = !DILocation(line: 150, column: 43, scope: !1316)
!1324 = !DILocation(line: 150, column: 33, scope: !1316)
!1325 = !DILocation(line: 150, column: 6, scope: !1290)
!1326 = !DILocation(line: 152, column: 17, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1316, file: !3, line: 151, column: 3)
!1328 = !DILocation(line: 152, column: 21, scope: !1327)
!1329 = !DILocation(line: 152, column: 29, scope: !1327)
!1330 = !DILocation(line: 152, column: 20, scope: !1327)
!1331 = !DILocation(line: 152, column: 15, scope: !1327)
!1332 = !DILocation(line: 153, column: 30, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1327, file: !3, line: 153, column: 7)
!1334 = !DILocation(line: 153, column: 38, scope: !1333)
!1335 = !DILocation(line: 153, column: 56, scope: !1333)
!1336 = !DILocation(line: 153, column: 64, scope: !1333)
!1337 = !DILocation(line: 153, column: 55, scope: !1333)
!1338 = !DILocation(line: 153, column: 22, scope: !1333)
!1339 = !DILocation(line: 153, column: 12, scope: !1333)
!1340 = !DILocation(line: 153, column: 7, scope: !1327)
!1341 = !DILocation(line: 155, column: 20, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1333, file: !3, line: 154, column: 4)
!1343 = !DILocation(line: 155, column: 4, scope: !1342)
!1344 = !DILocation(line: 155, column: 12, scope: !1342)
!1345 = !DILocation(line: 155, column: 18, scope: !1342)
!1346 = !DILocation(line: 156, column: 4, scope: !1342)
!1347 = !DILocation(line: 156, column: 12, scope: !1342)
!1348 = !DILocation(line: 156, column: 23, scope: !1342)
!1349 = !DILocation(line: 157, column: 19, scope: !1342)
!1350 = !DILocation(line: 157, column: 23, scope: !1342)
!1351 = !DILocation(line: 157, column: 31, scope: !1342)
!1352 = !DILocation(line: 157, column: 22, scope: !1342)
!1353 = !DILocation(line: 157, column: 4, scope: !1342)
!1354 = !DILocation(line: 157, column: 12, scope: !1342)
!1355 = !DILocation(line: 157, column: 17, scope: !1342)
!1356 = !DILocation(line: 159, column: 18, scope: !1342)
!1357 = !DILocation(line: 159, column: 22, scope: !1342)
!1358 = !DILocation(line: 159, column: 21, scope: !1342)
!1359 = !DILocation(line: 159, column: 4, scope: !1342)
!1360 = !DILocation(line: 159, column: 12, scope: !1342)
!1361 = !DILocation(line: 159, column: 16, scope: !1342)
!1362 = !DILocation(line: 160, column: 11, scope: !1342)
!1363 = !DILocation(line: 160, column: 8, scope: !1342)
!1364 = !DILocation(line: 161, column: 4, scope: !1342)
!1365 = !DILocation(line: 165, column: 4, scope: !1366)
!1366 = distinct !DILexicalBlock(scope: !1333, file: !3, line: 163, column: 4)
!1367 = !DILocation(line: 167, column: 3, scope: !1327)
!1368 = !DILocation(line: 169, column: 9, scope: !1290)
!1369 = !DILocation(line: 169, column: 2, scope: !1290)
!1370 = !DILocation(line: 170, column: 1, scope: !1290)
!1371 = distinct !DISubprogram(name: "_midiWriteVarLen", scope: !3, file: !3, line: 114, type: !1372, isLocal: true, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!322, !322, !8}
!1374 = !DILocalVariable(name: "ptr", arg: 1, scope: !1371, file: !3, line: 114, type: !322)
!1375 = !DILocation(line: 114, column: 37, scope: !1371)
!1376 = !DILocalVariable(name: "n", arg: 2, scope: !1371, file: !3, line: 114, type: !8)
!1377 = !DILocation(line: 114, column: 46, scope: !1371)
!1378 = !DILocalVariable(name: "buffer", scope: !1371, file: !3, line: 116, type: !279)
!1379 = !DILocation(line: 116, column: 15, scope: !1371)
!1380 = !DILocalVariable(name: "value", scope: !1371, file: !3, line: 117, type: !279)
!1381 = !DILocation(line: 117, column: 15, scope: !1371)
!1382 = !DILocation(line: 117, column: 21, scope: !1371)
!1383 = !DILocation(line: 119, column: 11, scope: !1371)
!1384 = !DILocation(line: 119, column: 17, scope: !1371)
!1385 = !DILocation(line: 119, column: 9, scope: !1371)
!1386 = !DILocation(line: 120, column: 2, scope: !1371)
!1387 = !DILocation(line: 120, column: 16, scope: !1371)
!1388 = !DILocation(line: 120, column: 23, scope: !1371)
!1389 = !DILocation(line: 122, column: 10, scope: !1390)
!1390 = distinct !DILexicalBlock(scope: !1371, file: !3, line: 121, column: 3)
!1391 = !DILocation(line: 123, column: 10, scope: !1390)
!1392 = !DILocation(line: 124, column: 14, scope: !1390)
!1393 = !DILocation(line: 124, column: 20, scope: !1390)
!1394 = !DILocation(line: 124, column: 10, scope: !1390)
!1395 = distinct !{!1395, !1386, !1396}
!1396 = !DILocation(line: 125, column: 3, scope: !1371)
!1397 = !DILocation(line: 127, column: 2, scope: !1371)
!1398 = !DILocation(line: 129, column: 18, scope: !1399)
!1399 = distinct !DILexicalBlock(scope: !1371, file: !3, line: 128, column: 3)
!1400 = !DILocation(line: 129, column: 12, scope: !1399)
!1401 = !DILocation(line: 129, column: 7, scope: !1399)
!1402 = !DILocation(line: 129, column: 10, scope: !1399)
!1403 = !DILocation(line: 130, column: 7, scope: !1404)
!1404 = distinct !DILexicalBlock(scope: !1399, file: !3, line: 130, column: 7)
!1405 = !DILocation(line: 130, column: 14, scope: !1404)
!1406 = !DILocation(line: 130, column: 7, scope: !1399)
!1407 = !DILocation(line: 131, column: 11, scope: !1404)
!1408 = !DILocation(line: 131, column: 4, scope: !1404)
!1409 = !DILocation(line: 133, column: 4, scope: !1404)
!1410 = distinct !{!1410, !1397, !1411}
!1411 = !DILocation(line: 134, column: 3, scope: !1371)
!1412 = !DILocation(line: 136, column: 9, scope: !1371)
!1413 = !DILocation(line: 136, column: 2, scope: !1371)
!1414 = distinct !DISubprogram(name: "midiFileSyncTracks", scope: !3, file: !3, line: 514, type: !401, isLocal: false, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!1415 = !DILocalVariable(name: "_pMF", arg: 1, scope: !1414, file: !3, line: 514, type: !9)
!1416 = !DILocation(line: 514, column: 36, scope: !1414)
!1417 = !DILocalVariable(name: "iTrack1", arg: 2, scope: !1414, file: !3, line: 514, type: !8)
!1418 = !DILocation(line: 514, column: 46, scope: !1414)
!1419 = !DILocalVariable(name: "iTrack2", arg: 3, scope: !1414, file: !3, line: 514, type: !8)
!1420 = !DILocation(line: 514, column: 59, scope: !1414)
!1421 = !DILocalVariable(name: "p1", scope: !1414, file: !3, line: 516, type: !8)
!1422 = !DILocation(line: 516, column: 5, scope: !1414)
!1423 = !DILocalVariable(name: "p2", scope: !1414, file: !3, line: 516, type: !8)
!1424 = !DILocation(line: 516, column: 9, scope: !1414)
!1425 = !DILocalVariable(name: "pMF", scope: !1414, file: !3, line: 518, type: !240)
!1426 = !DILocation(line: 518, column: 2, scope: !1414)
!1427 = !DILocation(line: 519, column: 7, scope: !1428)
!1428 = distinct !DILexicalBlock(scope: !1414, file: !3, line: 519, column: 6)
!1429 = !DILocation(line: 519, column: 6, scope: !1414)
!1430 = !DILocation(line: 519, column: 30, scope: !1428)
!1431 = !DILocation(line: 520, column: 7, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1414, file: !3, line: 520, column: 6)
!1433 = !DILocation(line: 520, column: 6, scope: !1414)
!1434 = !DILocation(line: 520, column: 32, scope: !1432)
!1435 = !DILocation(line: 521, column: 7, scope: !1436)
!1436 = distinct !DILexicalBlock(scope: !1414, file: !3, line: 521, column: 6)
!1437 = !DILocation(line: 521, column: 6, scope: !1414)
!1438 = !DILocation(line: 521, column: 32, scope: !1436)
!1439 = !DILocation(line: 523, column: 7, scope: !1414)
!1440 = !DILocation(line: 523, column: 12, scope: !1414)
!1441 = !DILocation(line: 523, column: 18, scope: !1414)
!1442 = !DILocation(line: 523, column: 27, scope: !1414)
!1443 = !DILocation(line: 523, column: 33, scope: !1414)
!1444 = !DILocation(line: 523, column: 38, scope: !1414)
!1445 = !DILocation(line: 523, column: 44, scope: !1414)
!1446 = !DILocation(line: 523, column: 53, scope: !1414)
!1447 = !DILocation(line: 523, column: 31, scope: !1414)
!1448 = !DILocation(line: 523, column: 5, scope: !1414)
!1449 = !DILocation(line: 524, column: 7, scope: !1414)
!1450 = !DILocation(line: 524, column: 12, scope: !1414)
!1451 = !DILocation(line: 524, column: 18, scope: !1414)
!1452 = !DILocation(line: 524, column: 27, scope: !1414)
!1453 = !DILocation(line: 524, column: 33, scope: !1414)
!1454 = !DILocation(line: 524, column: 38, scope: !1414)
!1455 = !DILocation(line: 524, column: 44, scope: !1414)
!1456 = !DILocation(line: 524, column: 53, scope: !1414)
!1457 = !DILocation(line: 524, column: 31, scope: !1414)
!1458 = !DILocation(line: 524, column: 5, scope: !1414)
!1459 = !DILocation(line: 526, column: 6, scope: !1460)
!1460 = distinct !DILexicalBlock(scope: !1414, file: !3, line: 526, column: 6)
!1461 = !DILocation(line: 526, column: 11, scope: !1460)
!1462 = !DILocation(line: 526, column: 9, scope: !1460)
!1463 = !DILocation(line: 526, column: 6, scope: !1414)
!1464 = !DILocation(line: 526, column: 33, scope: !1460)
!1465 = !DILocation(line: 526, column: 38, scope: !1460)
!1466 = !DILocation(line: 526, column: 47, scope: !1460)
!1467 = !DILocation(line: 526, column: 50, scope: !1460)
!1468 = !DILocation(line: 526, column: 49, scope: !1460)
!1469 = !DILocation(line: 526, column: 16, scope: !1460)
!1470 = !DILocation(line: 527, column: 11, scope: !1471)
!1471 = distinct !DILexicalBlock(scope: !1460, file: !3, line: 527, column: 11)
!1472 = !DILocation(line: 527, column: 16, scope: !1471)
!1473 = !DILocation(line: 527, column: 14, scope: !1471)
!1474 = !DILocation(line: 527, column: 11, scope: !1460)
!1475 = !DILocation(line: 527, column: 37, scope: !1471)
!1476 = !DILocation(line: 527, column: 42, scope: !1471)
!1477 = !DILocation(line: 527, column: 51, scope: !1471)
!1478 = !DILocation(line: 527, column: 54, scope: !1471)
!1479 = !DILocation(line: 527, column: 53, scope: !1471)
!1480 = !DILocation(line: 527, column: 20, scope: !1471)
!1481 = !DILocation(line: 529, column: 2, scope: !1414)
!1482 = !DILocation(line: 530, column: 1, scope: !1414)
!1483 = distinct !DISubprogram(name: "midiTrackIncTime", scope: !3, file: !3, line: 744, type: !1484, isLocal: false, isDefinition: true, scopeLine: 745, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!6, !9, !8, !8, !6}
!1486 = !DILocalVariable(name: "_pMF", arg: 1, scope: !1483, file: !3, line: 744, type: !9)
!1487 = !DILocation(line: 744, column: 34, scope: !1483)
!1488 = !DILocalVariable(name: "iTrack", arg: 2, scope: !1483, file: !3, line: 744, type: !8)
!1489 = !DILocation(line: 744, column: 44, scope: !1483)
!1490 = !DILocalVariable(name: "iDeltaTime", arg: 3, scope: !1483, file: !3, line: 744, type: !8)
!1491 = !DILocation(line: 744, column: 56, scope: !1483)
!1492 = !DILocalVariable(name: "bOverridePPQN", arg: 4, scope: !1483, file: !3, line: 744, type: !6)
!1493 = !DILocation(line: 744, column: 73, scope: !1483)
!1494 = !DILocalVariable(name: "will_end_at", scope: !1483, file: !3, line: 746, type: !315)
!1495 = !DILocation(line: 746, column: 7, scope: !1483)
!1496 = !DILocalVariable(name: "pMF", scope: !1483, file: !3, line: 748, type: !240)
!1497 = !DILocation(line: 748, column: 2, scope: !1483)
!1498 = !DILocation(line: 749, column: 7, scope: !1499)
!1499 = distinct !DILexicalBlock(scope: !1483, file: !3, line: 749, column: 6)
!1500 = !DILocation(line: 749, column: 6, scope: !1483)
!1501 = !DILocation(line: 749, column: 31, scope: !1499)
!1502 = !DILocation(line: 750, column: 7, scope: !1503)
!1503 = distinct !DILexicalBlock(scope: !1483, file: !3, line: 750, column: 6)
!1504 = !DILocation(line: 750, column: 6, scope: !1483)
!1505 = !DILocation(line: 750, column: 32, scope: !1503)
!1506 = !DILocation(line: 752, column: 31, scope: !1483)
!1507 = !DILocation(line: 752, column: 36, scope: !1483)
!1508 = !DILocation(line: 752, column: 43, scope: !1483)
!1509 = !DILocation(line: 752, column: 49, scope: !1483)
!1510 = !DILocation(line: 752, column: 61, scope: !1483)
!1511 = !DILocation(line: 752, column: 16, scope: !1483)
!1512 = !DILocation(line: 752, column: 14, scope: !1483)
!1513 = !DILocation(line: 753, column: 17, scope: !1483)
!1514 = !DILocation(line: 753, column: 22, scope: !1483)
!1515 = !DILocation(line: 753, column: 28, scope: !1483)
!1516 = !DILocation(line: 753, column: 36, scope: !1483)
!1517 = !DILocation(line: 753, column: 42, scope: !1483)
!1518 = !DILocation(line: 753, column: 47, scope: !1483)
!1519 = !DILocation(line: 753, column: 53, scope: !1483)
!1520 = !DILocation(line: 753, column: 61, scope: !1483)
!1521 = !DILocation(line: 753, column: 40, scope: !1483)
!1522 = !DILocation(line: 753, column: 14, scope: !1483)
!1523 = !DILocation(line: 755, column: 21, scope: !1483)
!1524 = !DILocation(line: 755, column: 26, scope: !1483)
!1525 = !DILocation(line: 755, column: 41, scope: !1483)
!1526 = !DILocation(line: 755, column: 2, scope: !1483)
!1527 = !DILocation(line: 757, column: 2, scope: !1483)
!1528 = !DILocation(line: 758, column: 1, scope: !1483)
!1529 = distinct !DISubprogram(name: "_midiGetLength", scope: !3, file: !3, line: 173, type: !1530, isLocal: true, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !11, variables: !378)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!8, !8, !8, !6}
!1532 = !DILocalVariable(name: "ppqn", arg: 1, scope: !1529, file: !3, line: 173, type: !8)
!1533 = !DILocation(line: 173, column: 31, scope: !1529)
!1534 = !DILocalVariable(name: "iNoteLen", arg: 2, scope: !1529, file: !3, line: 173, type: !8)
!1535 = !DILocation(line: 173, column: 41, scope: !1529)
!1536 = !DILocalVariable(name: "bOverride", arg: 3, scope: !1529, file: !3, line: 173, type: !6)
!1537 = !DILocation(line: 173, column: 56, scope: !1529)
!1538 = !DILocalVariable(name: "length", scope: !1529, file: !3, line: 175, type: !8)
!1539 = !DILocation(line: 175, column: 5, scope: !1529)
!1540 = !DILocation(line: 175, column: 14, scope: !1529)
!1541 = !DILocation(line: 177, column: 6, scope: !1542)
!1542 = distinct !DILexicalBlock(scope: !1529, file: !3, line: 177, column: 6)
!1543 = !DILocation(line: 177, column: 6, scope: !1529)
!1544 = !DILocation(line: 179, column: 12, scope: !1545)
!1545 = distinct !DILexicalBlock(scope: !1542, file: !3, line: 178, column: 3)
!1546 = !DILocation(line: 179, column: 10, scope: !1545)
!1547 = !DILocation(line: 180, column: 3, scope: !1545)
!1548 = !DILocation(line: 183, column: 10, scope: !1549)
!1549 = distinct !DILexicalBlock(scope: !1542, file: !3, line: 182, column: 3)
!1550 = !DILocation(line: 183, column: 3, scope: !1549)
!1551 = !DILocation(line: 186, column: 14, scope: !1552)
!1552 = distinct !DILexicalBlock(scope: !1549, file: !3, line: 184, column: 4)
!1553 = !DILocation(line: 187, column: 7, scope: !1552)
!1554 = !DILocation(line: 190, column: 14, scope: !1552)
!1555 = !DILocation(line: 191, column: 14, scope: !1552)
!1556 = !DILocation(line: 192, column: 7, scope: !1552)
!1557 = !DILocation(line: 195, column: 14, scope: !1552)
!1558 = !DILocation(line: 196, column: 14, scope: !1552)
!1559 = !DILocation(line: 197, column: 7, scope: !1552)
!1560 = !DILocation(line: 200, column: 14, scope: !1552)
!1561 = !DILocation(line: 201, column: 14, scope: !1552)
!1562 = !DILocation(line: 202, column: 7, scope: !1552)
!1563 = !DILocation(line: 205, column: 14, scope: !1552)
!1564 = !DILocation(line: 206, column: 14, scope: !1552)
!1565 = !DILocation(line: 207, column: 7, scope: !1552)
!1566 = !DILocation(line: 210, column: 14, scope: !1552)
!1567 = !DILocation(line: 211, column: 7, scope: !1552)
!1568 = !DILocation(line: 214, column: 14, scope: !1552)
!1569 = !DILocation(line: 215, column: 7, scope: !1552)
!1570 = !DILocation(line: 218, column: 14, scope: !1552)
!1571 = !DILocation(line: 219, column: 7, scope: !1552)
!1572 = !DILocation(line: 222, column: 14, scope: !1552)
!1573 = !DILocation(line: 223, column: 7, scope: !1552)
!1574 = !DILocation(line: 226, column: 14, scope: !1552)
!1575 = !DILocation(line: 227, column: 7, scope: !1552)
!1576 = !DILocation(line: 230, column: 14, scope: !1552)
!1577 = !DILocation(line: 231, column: 14, scope: !1552)
!1578 = !DILocation(line: 232, column: 7, scope: !1552)
!1579 = !DILocation(line: 236, column: 9, scope: !1529)
!1580 = !DILocation(line: 236, column: 2, scope: !1529)
!1581 = !DILocalVariable(name: "_pMF", arg: 1, scope: !2, file: !3, line: 533, type: !9)
!1582 = !DILocation(line: 533, column: 31, scope: !2)
!1583 = !DILocalVariable(name: "pMF", scope: !2, file: !3, line: 535, type: !240)
!1584 = !DILocation(line: 535, column: 2, scope: !2)
!1585 = !DILocation(line: 536, column: 7, scope: !1586)
!1586 = distinct !DILexicalBlock(scope: !2, file: !3, line: 536, column: 6)
!1587 = !DILocation(line: 536, column: 6, scope: !2)
!1588 = !DILocation(line: 536, column: 30, scope: !1586)
!1589 = !DILocation(line: 538, column: 6, scope: !1590)
!1590 = distinct !DILexicalBlock(scope: !2, file: !3, line: 538, column: 6)
!1591 = !DILocation(line: 538, column: 11, scope: !1590)
!1592 = !DILocation(line: 538, column: 6, scope: !2)
!1593 = !DILocalVariable(name: "iNumTracks", scope: !1594, file: !3, line: 540, type: !318)
!1594 = distinct !DILexicalBlock(scope: !1590, file: !3, line: 539, column: 3)
!1595 = !DILocation(line: 540, column: 8, scope: !1594)
!1596 = !DILocalVariable(name: "wTest", scope: !1594, file: !3, line: 541, type: !318)
!1597 = !DILocation(line: 541, column: 8, scope: !1594)
!1598 = !DILocalVariable(name: "bSwap", scope: !1594, file: !3, line: 542, type: !6)
!1599 = !DILocation(line: 542, column: 8, scope: !1594)
!1600 = !DILocalVariable(name: "i", scope: !1594, file: !3, line: 543, type: !8)
!1601 = !DILocation(line: 543, column: 7, scope: !1594)
!1602 = !DILocation(line: 546, column: 7, scope: !1603)
!1603 = distinct !DILexicalBlock(scope: !1594, file: !3, line: 546, column: 7)
!1604 = !DILocation(line: 546, column: 25, scope: !1603)
!1605 = !DILocation(line: 546, column: 7, scope: !1594)
!1606 = !DILocation(line: 547, column: 10, scope: !1603)
!1607 = !DILocation(line: 547, column: 4, scope: !1603)
!1608 = !DILocation(line: 550, column: 8, scope: !1609)
!1609 = distinct !DILexicalBlock(scope: !1594, file: !3, line: 550, column: 3)
!1610 = !DILocation(line: 550, column: 7, scope: !1609)
!1611 = !DILocation(line: 550, column: 11, scope: !1612)
!1612 = distinct !DILexicalBlock(scope: !1609, file: !3, line: 550, column: 3)
!1613 = !DILocation(line: 550, column: 12, scope: !1612)
!1614 = !DILocation(line: 550, column: 3, scope: !1609)
!1615 = !DILocation(line: 552, column: 8, scope: !1616)
!1616 = distinct !DILexicalBlock(scope: !1617, file: !3, line: 552, column: 8)
!1617 = distinct !DILexicalBlock(scope: !1612, file: !3, line: 551, column: 4)
!1618 = !DILocation(line: 552, column: 13, scope: !1616)
!1619 = !DILocation(line: 552, column: 19, scope: !1616)
!1620 = !DILocation(line: 552, column: 22, scope: !1616)
!1621 = !DILocation(line: 552, column: 8, scope: !1617)
!1622 = !DILocation(line: 554, column: 28, scope: !1623)
!1623 = distinct !DILexicalBlock(scope: !1616, file: !3, line: 553, column: 5)
!1624 = !DILocation(line: 554, column: 33, scope: !1623)
!1625 = !DILocation(line: 554, column: 5, scope: !1623)
!1626 = !DILocation(line: 555, column: 24, scope: !1623)
!1627 = !DILocation(line: 555, column: 29, scope: !1623)
!1628 = !DILocation(line: 555, column: 5, scope: !1623)
!1629 = !DILocation(line: 556, column: 15, scope: !1623)
!1630 = !DILocation(line: 557, column: 5, scope: !1623)
!1631 = !DILocation(line: 558, column: 4, scope: !1617)
!1632 = !DILocation(line: 550, column: 29, scope: !1612)
!1633 = !DILocation(line: 550, column: 3, scope: !1612)
!1634 = distinct !{!1634, !1614, !1635}
!1635 = !DILocation(line: 558, column: 4, scope: !1609)
!1636 = !DILocalVariable(name: "dwData", scope: !1637, file: !3, line: 564, type: !315)
!1637 = distinct !DILexicalBlock(scope: !1594, file: !3, line: 562, column: 3)
!1638 = !DILocation(line: 564, column: 9, scope: !1637)
